[
  {
    "path": "posts/2021-08-19-distance-measurement-and-leveling/",
    "title": "Distance and Elevation Measurements",
    "description": "The purposed of this lab is to learn how to take linear and elevation measurements and record data in the field and level book.",
    "author": [
      {
        "name": "ECIV 340L, CEE, UofSC",
        "url": {}
      }
    ],
    "date": "2021-08-27",
    "categories": [],
    "contents": "\r\n\r\nContents\r\nDistance and Elevation Measurement\r\nMethods\r\nLinear Measurements\r\nTaping\r\nPacing\r\n\r\nElevation Measurements\r\nLeveling\r\nDifferential Leveling\r\n\r\n\r\n\r\n\r\nbody {\r\ntext-align: justify}\r\n\r\n\r\n\r\nRELATED RESOUCES:\r\nLECTURE SLIDES\r\nDEMO CALCULATION\r\nLEVEL BOOK\r\nFIELD BOOK\r\nDATA FORM\r\nLAB PROCEDURE (FIELD)\r\nDistance and Elevation Measurement\r\nDistance measurement is generally regarded as the most fundamental of all surveying observations. In traditional ground surveys, even though many angles may be read, the length of at least one line must be measured to supplement the angles in locating points. In plane surveying, the distance between two points means the horizontal distance.\r\nIf the points are at different elevations, the distance is the horizontal length between vertical lines at the points. Lengths of lines may be specified in different units. In the United States, the foot, decimally divided, is usually used although the meter is becoming increasingly more common. Geodetic surveys, and many highway surveys employ the meter. In architectural and machine work, and on some construction projects, the unit is a foot divided into inches and fractions of an inch.\r\nMethods\r\nLinear Measurements\r\nIn surveying, linear measurements have been obtained by many different methods. These include:\r\npacing,\r\nodometer readings,\r\noptical rangefinders,\r\ntacheometry (stadia),\r\nsubtense bars,\r\ntaping,\r\nelectronic distance measurement (EDM),\r\nsatellite systems, and others.\r\nOf these, surveyors most commonly use taping, EDM, and satellite systems today. In particular, the satellite-supported Global Navigation Satellite Systems (GNSS) are rapidly replacing all other systems due to many advantages, but most notably because of their range, accuracy, and efficiency.\r\nTaping\r\n\r\nPacing\r\nDistances obtained by pacing are sufficiently accurate for many purposes in surveying, engineering, geology, agriculture, forestry, and military field sketching. Pacing is also used to detect blunders that may occur in making distance observations by more accurate methods.\r\nPacing consists of counting the number of steps, or paces, in a required distance. The length of an individual’s pace must be determined first. This is best done by walking with natural steps back and forth over a level course at least 300 ft long and dividing the known distance by the average number of steps. For short distances, the length of each pace is needed, but the number of steps taken per 100 ft is desirable for checking long lines.\r\nPacing is one of the most valuable things learned in surveying, since it has practical applications for everybody and requires no equipment. If the terrain is open and reasonably level, experienced pacers can measure distances of 100 ft or longer with an accuracy of 1/50 to 1/100 of the distance.\r\nElevation Measurements\r\nLeveling\r\nLeveling is the general term applied to any of the various processes by which elevations of points or differences in elevation are determined. It is a vital operation in producing necessary data for mapping, engineering design, and construction. Leveling results are used to (1) design highways, railroads, canals, sewers, water supply systems, and other facilities having grade lines that best conform to existing topography; (2) lay out construction projects according to planned elevations; (3) calculate volumes of earthwork and other materials; (4) investigate drainage characteristics of an area; (5) develop maps showing general ground configurations; and (6) study earth subsidence and crustal motion.\r\nDefinitions\r\n\r\nLeveling: The process of finding elevations of points or their differences in elevation.Benchmark (BM): A relatively permanent object, natural or artificial, having a marked point whose elevation above or below a reference datum is known or assumed.Backsight (BS): A sight taken to the level rod held at a point of known elevation (either a BM or TP).Height of instrument (HI): The elevation of the line of sight of the telescope.Foresight (FS): A sight taken on any point to determine its elevation.\r\nDifferential Leveling\r\nDifferential leveling is the process of measuring vertical distances from a known elevation point to determine elevations of unknown points.\r\n\r\nThe elevation of point A is 100 feet. Using this information determine the elevation of point B.\r\nSteps 1:\r\n\r\nStep 2:\r\n\r\nStep 3:\r\n\r\nStep 4:\r\n\r\nStep 5:\r\n\r\nStep 6:\r\n\r\nStep 7:\r\n\r\nThe elevation of point B = 105.92 feet.\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-08-26T16:49:32-04:00",
    "input_file": {}
  },
  {
    "path": "posts/2021-08-20-first-class/",
    "title": "ECIV 340L Introduction: Fall 2021",
    "description": "First Class of Fall 2021",
    "author": [
      {
        "name": "ECIV 340L, CEE, UofSC",
        "url": {}
      }
    ],
    "date": "2021-08-20",
    "categories": [],
    "contents": "\r\n\r\nbody {\r\ntext-align: justify}\r\nRELATED RESOUCES:\r\nLECTURE SLIDES\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-08-20T11:36:41-04:00",
    "input_file": {}
  }
]
