[
  {
    "path": "posts/2021-10-22-turning-movement-count-tmc/",
    "title": "Turning Movement Count (TMC)",
    "description": {},
    "author": [
      {
        "name": "ECIV 340L, CEE, UofSC",
        "url": {}
      }
    ],
    "date": "2021-10-22",
    "categories": [],
    "contents": "\r\n\r\nContents\r\nIntroduction\r\nEquipment\r\nData Collection\r\nData Analysis\r\nConclusions\r\n\r\n\r\nbody {\r\ntext-align: justify}\r\n\r\n\r\n\r\nRELATED RESOUCES:\r\nLECTURE SLIDES\r\nDATA FORM\r\n`DEMO CALCULATION\r\n`DEMO CALCULATION-2\r\nIntroduction\r\nAny traffic Study requires accurate traffic counts. Determining how many vehicles use a section of roadway or an intersection is necessary for analyzing and timing signals, determining capacity, and estimating the level of service that will be needed. Accurate counts of current traffic flow provide a departure point for estimates of future traffic volume. Moreover, the effectiveness of various traffic control measures, geometric modifications, or maintenance practices is governed by traffic volume data. The turning movement count at controlled intersections (those containing signs or signals) is another way to determine traffic volume.\r\nEquipment\r\nThe equipment list for data collection procedure is a stopwatch (cell phone) and note-taking materials.\r\nData Collection\r\nVisit the site, and choose a location and time to collect the data For this lab session, the student groups will gather data to identify the peak-hour traffic volume and how it varies at the peak-hour period.\r\nAs described the student groups will be measuring departure volumes. Departure volume denotes vehicles which are not counted until they have entered the intersection and executed their turning movements. This method serves most traffic engineering needs except when observing a signal at which the demand volume exceeds the capacity. Typically, the tuning movement counts (TMC) should start at least one hour before the projected peak hour and continue for one hour after the projected peak hour.\r\nCollect and record the data Data is observed in fifteen minute increments throughout the count periods—usually three hours. Before starting, the times marking the beginning of each fifteen-minute observation period are recorded. Then the watch is started, and the volume count begins. During each time period, the approach that each vehicle used to enter the intersection is recorded as well as whether it turned left, right, or continued straight when exiting the intersection. The Turning Movement Count Data Collection Form has a column for each of the twelve possible movements that can occur at the intersection. At the end of each fifteen-minute period, the observer continues counting but now records the data on the next row, and so on, until the counting period is complete.\r\nCheck your work before leaving the field Before leaving the field, the data collection form should be checked to see that all field data have been collected correctly. Any unusual observations should be listed as comments.\r\nData Analysis\r\nCheck the data Even though the data is checked for completeness prior to leaving the field, it is wise to check each Field Data Sheet again prior to reduction and analysis.\r\nSummarize field sheets Class demo\r\nIdentify the peak hour, and compute the peak-hour factor The peak hour and the peak-hour factor are computed from the entries on the summary sheet. The peak hour is determined by identifying the four consecutive fifteen-minute (1-hour) periods having the highest volume. The peak-hour factor (PHF) is a valuable indicator of flow variability within the peak hour. It is computed by dividing the peak-hour volume by the Peak Rate of Flow. The Peak Rate of Flow is four times the peak fifteen-minute flow within the peak hour. PHF’s can range from a low of 0.25 to a high of 1.00. PHF of 0.25 indicates all of the peak hour traffic occurs during the one fifteen-minute interval whereas PHF of 1.00 indicates the peak hour traffic is spread out evenly throughout the hour.\r\nNote: Computation of the peak-hour factor is not limited to the intersection as a whole. It can be computed for each approach and for each lane or lane groups as well.\r\nClass demo\r\nPrepare a graphical summary While a tabular summary is useful, a graphical summary presents information that can be more readily comprehended. A check of the entries can be made by summing all of the values for vehicles entering the intersection and comparing it to the sum of the values for vehicle exiting the intersection.\r\nClass demo\r\nUse the HCS7 TWSC module to create report Class demo\r\nInterpret the data and draw conclusions Interpretation of volume data depends on the use for which the count was conducted. Among the questions to be addressed are: • Is the traffic evenly distributed among all the approaches to the intersection? • Does the peak-hour factor indicate that a surge of traffic is arriving at the intersection during particular time frame, or is the traffic spread out evenly over the peak hour? • Are there heavy turning volumes? • What percentage of the approach volume is heavy vehicles?\r\nConclusions\r\nThe last step is to draw conclusion based on the vehicle counts and the report produced from HCS7.\r\nNote: While some of these questions may lead to useful conclusions, volume data alone cannot answer all the questions that may arise about an intersection. Additional information such as accident history, signal timing, pedestrian flow, and volume distribution throughout the remainder of the day may be needed to complete the traffic engineering analysis.\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-10-22T21:32:49-04:00",
    "input_file": {}
  },
  {
    "path": "posts/2021-10-14-spot-speed-study/",
    "title": "Spot Speed Study",
    "description": {},
    "author": [
      {
        "name": "ECIV 340L, CEE, UofSC",
        "url": {}
      }
    ],
    "date": "2021-10-15",
    "categories": [],
    "contents": "\r\n\r\nContents\r\nIntroduction\r\nEquipment\r\nData Collection\r\nData Analysis\r\nConclusions\r\n\r\n\r\nbody {\r\ntext-align: justify}\r\n\r\n\r\n\r\nRELATED RESOUCES:\r\nLECTURE SLIDES\r\nDATA FORM\r\n`DEMO CALCULATION\r\nIntroduction\r\nObserving vehicle speeds is one way traffic engineers measure travel safety on roadways. High speeds carry a high risk, whereas low speeds are relatively safe. In addition, observed speeds are used in capacity analysis, crash analysis, geometric studies, determining the need for pedestrian crossings, and in before-and-after studies to assess the effectiveness of roadway modifications. Also, speed observations are compared to the posted speed limit to help determine whether the roadway is in need of greater law enforcement, realignment, or reconstruction. With so many important decisions being based on observed speeds, it is imperative that such speed data be collected correctly and presented effectively.\r\nEquipment\r\nThe equipment list for data collection procedure is: a stopwatch (cell phone), measuring tape/wheel, and note taking materials.\r\nData Collection\r\nVisit the site, and choose a location and time to take observations\r\nFor this lab, the student groups will gather data during the off-peak period during daylight hours on a Friday.\r\nMark the speed trap\r\nThe student groups will measure and mark a section of the road long enough to start a stopwatch when a vehicle enters the trap and stop it when the vehicle exists the trap. The recorded time is later used to compute vehicle speed. The trap’s length should be governed by the anticipated speeds of the observed traffic. Minimum suggested lengths are shown below:\r\nRecommended Trap Length\r\nIf Speed \\(< 25 mph\\) then min. length : \\(88 feet\\)\r\nIf Speed \\(25 - 40 mph\\) then min. length : \\(176 feet\\)\r\nIf Speed \\(> 40 mph\\) then min. length : \\(264 feet\\)\r\nPavements marking should be easily visible to those timing the vehicles. Markings should be placed outside the traveled way, preferably on sidewalks or curbs. Physical features such as utility poles, tress, and signposts can be used as the trap markers.\r\nCollect the data, and record it on the Spot Speed Study form\r\nThe student groups must use the attached Spot Speed Study Data Collection Form to record speed data. All of the information at the top of the form must be completed before data collection can proceed. When a vehicle enters the speed trap, and the watch is started; when the vehicle exists the trap the watch is stopped, and the time is recorded. The student groups should then repeat the process until at least 100 observations are obtained.\r\nCheck your work before leaving the field\r\nBefore leaving the field, the data collection form should be checked to see that all field data have been collected correctly. The student groups should compute one or two speeds from the observed times to see if they are reasonable.\r\nData Analysis\r\nCompute speeds\r\nA column is provided on the data collection sheet to compute the speed of the vehicles observed. The speed can be computed using the formula:\r\n\\(V = d / 1.47t\\)\r\nwhere \\(V\\) is the speed in miles per hour, \\(d\\) is the length of the trap in feet, and \\(t\\) is the recorded time in seconds.\r\nConstruct speed groups\r\nClass demo\r\nPlot histogram\r\nClass demo\r\nCompute frequency and cumulative frequency\r\nClass demo\r\nPlot cumulative frequency curve\r\nClass demo\r\nDetermine\r\nthe mean speed,\r\nthe standard deviation of speed,\r\nthe median speed (50th percentile speed),\r\nthe pace,\r\nthe mode or modal speed,\r\nthe 85th percentile speed\r\nClass demo\r\nPace: the range of speed—usually taken at 10 mph intervals—that has the greatest number of observations.\r\nInterpret the speed curve\r\nConclusions\r\nThe last step is to draw conclusion based on the observed speed data.\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-10-14T17:30:14-04:00",
    "input_file": {}
  },
  {
    "path": "posts/2021-09-30-surface-area-and-volume/",
    "title": "Surface Area and Earthwork",
    "description": "The purposed of this lab is to learn how to identify station in the highway horizontal curve using Total Station (TS).",
    "author": [
      {
        "name": "ECIV 340L, CEE, UofSC",
        "url": {}
      }
    ],
    "date": "2021-10-01",
    "categories": [],
    "contents": "\r\n\r\nContents\r\nSurface Area\r\nEarthwork (Volume)\r\nSample Task\r\n\r\n\r\nbody {\r\ntext-align: justify}\r\n\r\n\r\n\r\nRELATED RESOUCES:\r\nLECTURE SLIDES\r\nLEVEL BOOK\r\nFIELD BOOK\r\nDATA FORM\r\nLAB PROCEDURE (FIELD)\r\n`DEMO CALCULATION\r\nSurface Area\r\nThere are a number of important reasons for determining areas. One is to include the acreage of a parcel of land in the deed describing the property. Other purposes are to determine the acreage of fields, lakes, etc., or the number of square yards to be surfaced, paved, seeded, or sodded. Another important application is determining end areas for earthwork volume calculations. In plane surveying, area is considered to be the orthogonal projection of the surface onto a horizontal plane. In the English system, the most commonly used units for specifying small areas are the ft2 and yd2, and for large tracts the acre is most often used, where 1 acre = 43,560 ft2. In the metric system, smaller areas are usually given in m2, and for larger tracts hectares are commonly used, where 1 hectare is equivalent to a square having sides of 100 m, and thus equals 10,000 m2. In converting areas between the English and metric systems, the conversion factors given below are useful.\r\n\r\nBoth field and map measurements are used to determine area. Field measurement methods are the more accurate and include:\r\ndivision of the tract into simple figures (triangles, rectangles, and trapezoids),\r\noffsets from a straight line,\r\ncoordinates, and\r\ndouble-meridian distances.\r\nMethods of determining area from map measurements include:\r\ncounting coordinate squares,\r\ndividing the area into triangles, rectangles, or other regular geometric shapes,\r\ndigitizing coordinates, and\r\nrunning a planimeter over the enclosing lines.\r\n\r\n\r\n\r\n\r\nEarthwork (Volume)\r\nPersons engaged in surveying (geomatics) are often called on to determine volumes of various types of material. Quantities of earthwork and concrete are needed, for example, on many types of construction projects. Volume computations are also required to determine the capacities of bins, tanks, reservoirs, and buildings, and to check stockpiles of coal, gravel, and other materials. The most common unit of volume is a cube having edges of unit length. Cubic feet, cubic yards, and cubic meters are used in surveying calculations, with cubic yards and cubic meters being most common for earthwork. Note 1 yd3 = 27 ft3; 1 m3 = 35.3144 ft3. Direct measurement of volumes is rarely made in surveying, since it is difficult to actually apply a unit of measure to the material involved. Instead, indirect measurements are obtained by measuring lines and areas that have a relationship to the volume desired. Three principal systems are used:\r\nthe cross-section method,\r\nthe unit-area (or borrow-pit) method, and\r\nthe contour-area method.\r\n\r\n\r\n\r\n\r\nSample Task\r\n\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-09-30T17:04:35-04:00",
    "input_file": {}
  },
  {
    "path": "posts/2021-09-23-highway-alignment-field/",
    "title": "Highway Alignment (Field)",
    "description": "The purposed of this lab is to learn how to identify station in the highway horizontal curve using Total Station (TS).",
    "author": [
      {
        "name": "ECIV 340L, CEE, UofSC",
        "url": {}
      }
    ],
    "date": "2021-09-24",
    "categories": [],
    "contents": "\r\n\r\nContents\r\nHORIZONTAL ALIGNMENT\r\nDegree of Circular Curve\r\nCircular Curve Equations\r\nCircular Curve Stationing\r\nCircular Curve Layout Methods\r\nComputing Deflection Angles and Chords\r\nTask 1: Circular Curve Layout with a Total Station\r\nSteps\r\nField Book Sample:\r\n\r\n\r\nVERTICAL ALIGNMENT\r\nVertical Curve Equations\r\nTask 2: Crest Vertical Curve Layout with a Total Station\r\n\r\n\r\n\r\nbody {\r\ntext-align: justify}\r\n\r\n\r\n\r\nRELATED RESOUCES:\r\nLECTURE SLIDES\r\nLEVEL BOOK\r\nFIELD BOOK\r\nDATA FORM\r\nLAB PROCEDURE (FIELD)\r\nDEMO CALCULATION\r\nHORIZONTAL ALIGNMENT\r\nCurves used in horizontal planes to connect two straight tangent sections are called horizontal curves. Two types are used: circular arcs and spirals. Both are readily laid out in the field with surveying equipment. A simple curve (Fig. 1a) is a circular arc connecting two tangents. It is the type most often used. A compound curve (Fig. 1b) is composed of two or more circular arcs of different radii tangent to each other, with their centers on the same side of the alignment. The combination of a short length of tangent (less than 100 ft) connecting two circular arcs that have centers on the same side (Fig. 1c) is called a broken-back curve. A reverse curve (Fig. 1d) consists of two circular arcs tangent to each other, with their centers on opposite sides of the alignment. Compound, broken-back, and reverse curves are unsuitable for modern high-speed highway, rapid transit, and railroad traffic and should be avoided, if possible. However, they are sometimes necessary in mountainous terrain to avoid excessive grades or very deep cuts and fills. Compound curves are often used on exit and entrance ramps of interstate highways and expressways, although easement curves are generally a better choice for these situations. Easement curves are desirable, especially for railroads and rapid transit systems, to lessen the sudden change in curvature at the junction of a tangent and a circular curve. A spiral makes an excellent easement curve because its radius decreases uniformly from infinity at the tangent to that of the curve it meets. Spirals are used to connect a tangent with a circular curve, a tangent with a tangent (double spiral), and a circular curve with a circular curve. Figure 2 illustrates these arrangements.\r\n\r\nThe effect of centrifugal force on a vehicle passing around a curve can be balanced by superelevation, which raises the outer rail of a track or outer edge of a highway pavement. Correct transition into superelevation on a spiral increases uniformly with the distance from the beginning of the spiral and is in inverse proportion to the radius at any point. Properly superelevated spirals ensure smooth and safe riding with less wear on equipment. As noted, spirals are used for railroads and rapid-transit systems. This is because trains are constrained to follow the tracks, and thus a smooth, safe, and comfortable ride can only be assured with properly constructed alignments that include easement curves. On highways, spirals are less frequently used because drivers are able to overcome abrupt directional changes at circular curves by steering a spiraled path as they enter and exit the curves.\r\nDegree of Circular Curve\r\nThe rate of curvature of circular curves can be designated either by their radius (e.g., a 1000-ft curve) or by their degree of curve. There are two different designations for degree of curve, the arc definition and the chord definition. By the arc definition, degree of curve is the central angle subtended by a circular arc of 100 ft (see Fig. 3a). This definition is preferred for highway work. By the chord definition, degree of curve is the angle at the center of a circular arc subtended by a chord of 100 ft (see Fig. 3b). This definition is convenient for very gentle curves and hence is preferred for railroads.\r\n\r\nCircular Curve Equations\r\n\r\nCircular Curve Stationing\r\nNormally, an initial route survey consists of establishing the PIs according to plan, laying out the tangents, and establishing continuous stationing along them from the start of the project, through each PI, to the end of the job. After the tangents have been staked and stationed, the intersection angle (I) is observed at each PI and curves computed and staked. The station locations of points on any curve are based upon the stationing of the curve’s PI. To compute the PC station, tangent distance T is subtracted from the PI station, and to calculate the PT station, curve length L is added to the PC station.\r\nCircular Curve Layout Methods\r\nExcept for unusual cases, the radii of curves on route surveys are too large to permit swinging an arc from the curve center. Circular curves are therefore laid out by more practical methods, including (1) deflection angles, (2) coordinates, (3) tangent offsets, (4) chord offsets, (5) middle ordinates, and (6) ordinates from the long chord.\r\nComputing Deflection Angles and Chords\r\nTo stake the first station, which is normally an odd distance from the PC (shorter than a full-station increment), subdeflection angle δ_a and subchord c_a are needed.\r\n\r\nTask 1: Circular Curve Layout with a Total Station\r\nAssume that I=4°12’, the station of the PI is 64 + 27.46, and terrain conditions require the minimum radius permitted by the specifications to be 2864.79 ft (arc definition). Layout the circular curve using a total station and total chord method.\r\n\r\nSteps\r\nRegardless of the method used to stake intermediate curve points, the first steps in curve layout are:\r\n(1) establishing the PC and PT, normally by measuring tangent distance T from the PI along both the back and forward tangents and\r\n(2) measuring the total deflection angle at the PC from PI to PT.\r\nWith the instrument set up and leveled over the PC, it is oriented by backsighting on the PI, or on a point along the back tangent, with 0°00’ on the circle. The subdeflection angle of 0°46’33\" is then turned. Meanwhile, the 22-ft mark of the tape is held on the PC. The zero end of the (add) tape is swung. This is station 63 + 00. Follow the same procedure to stake other stations.\r\nField Book Sample:\r\n\r\nVERTICAL ALIGNMENT\r\nThe vertical alignment contributes significantly to a highway’s safety, aesthetics, operations and costs. Long, gentle vertical curves provide greater sight distances and a more pleasing appearance for the driver. The design of vertical alignment involves, to a large extent, complying with specific limiting criteria. These criteria include maximum and minimum grades, sight distance at vertical curves and vertical clearances. In addition, the designer should adhere to certain general design principles and controls that will determine the overall safety and operation of the facility and will enhance the aesthetic appearance of the highway. Curves are needed to provide smooth transitions between straight segments (tangents) of grade lines for highways and railroads. Because these curves exist in vertical planes, they are called vertical curves. An example is illustrated in Figure 1, which shows the profile view of a proposed section of highway to be constructed from A to B. A grade line consisting of three tangent sections has been designed to fit the ground profile. Two vertical curves are needed: curve a to join tangents 1 and 2, and curve b to connect tangents 2 and 3. The function of each curve is to provide a gradual change in grade from the initial (back) tangent to the grade of the second (forward) tangent. Because parabolas provide a constant rate of change of grade, they are ideal and almost always applied for vertical alignments used by vehicular traffic. Two basic types of vertical curves exist, crest and sag. These are illustrated in Figure 1. Curve a is a crest type, which by definition undergoes a negative change in grade; that is, the curve turns downward. Curve b is a sag type, in which the change in grade is positive and the curve turns upward. There are several factors that must be taken into account when designing a grade line of tangents and curves on any highway or railroad project. They include (1) providing a good fit with the existing ground profile, thereby minimizing the depths of cuts and fills, (2) balancing the volume of cut material against fill, (3) maintaining adequate drainage, (4) not exceeding maximum specified grades, and (5) meeting fixed elevations such as intersections with other roads. In addition, the curves must be designed to (a) fit the grade lines they connect, (b) have lengths sufficient to meet specifications covering a maximum rate of change of grade (which affects the comfort of vehicle occupants), and (c) provide sufficient sight distance for safe vehicle operation.\r\n\r\nVertical Curve Equations\r\n\r\nTask 2: Crest Vertical Curve Layout with a Total Station\r\nA grade g_1 of +5.00% intersects grade g_2 of -4.40% at a vertex whose station and elevation are 45 + 00 and 855.50 ft, respectively. An equal-tangent parabolic curve 200 ft long has been selected to join two tangents. Layout the crest vertical curve using a total station.\r\n\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-09-23T17:06:36-04:00",
    "input_file": {}
  },
  {
    "path": "posts/2021-09-16-traverse-survey/",
    "title": "Traverse Survey",
    "description": "The purposed of this lab is to how to use data collected using Total Station (distance and angles) for closed-traverse calculation.",
    "author": [
      {
        "name": "ECIV 340L, CEE, UofSC",
        "url": {}
      }
    ],
    "date": "2021-09-17",
    "categories": [],
    "contents": "\r\n\r\nContents\r\nTRAVERSING\r\nDepartures and Latitudes\r\nTraverse Adjustment\r\nTraversing with a Total Station (Example)\r\nLab Task: Traversing\r\n\r\n\r\n\r\nbody {\r\ntext-align: justify}\r\n\r\n\r\n\r\nRELATED RESOUCES:\r\nLECTURE SLIDES\r\nLEVEL BOOK\r\nFIELD BOOK\r\nDATA FORM\r\nLAB PROCEDURE (FIELD)\r\nDEMO CALCULATION\r\nTRAVERSING\r\nA traverse is a series of consecutive lines whose ends have been marked in the field and whose lengths and directions have been determined from observations. In traditional surveying by ground methods, traversing, the act of marking the lines, that is, establishing traverse stations and making the necessary observations, is one of the most basic and widely practiced means of determining the relative locations of points. There are two kinds of traverses: closed and open. Two categories of closed traverses exist: polygon and link. In the polygon traverse, as shown in Fig. 1(a), the lines return to the starting point, thus forming a closed figure that is both geometrically and mathematically closed. Link traverses finish upon another station that should have a positional accuracy equal to or greater than that of the starting point. The link type (geometrically open, mathematically closed), as illustrated in Fig. 1(b), must have a closing reference direction. Closed traverses provide checks on the observed angles and distances, which is an extremely important consideration. They are used extensively in control, construction, property, and topographic surveys.\r\n\r\nAn open traverse (geometrically and mathematically open) (Fig. 2) consists of a series of lines that are connected but do not return to the starting point or close upon a point of equal or greater order accuracy. Open traverses should be avoided because they offer no means of checking for observational errors and mistakes.\r\n\r\nAzimuths: Azimuths are horizontal angles observed clockwise from any reference meridian. Azimuths have also been more generally defined as a horizontal angle measured clockwise from any fixed reference plane or easily established base direction line.\r\nBearings: Bearings are another system for designating directions of lines. The bearing of a line is defined as the acute horizontal angle between a reference meridian and the line. The angle is observed from either the north or south toward the east or west, to give a reading smaller than 90°. The letter N or S preceding the angle, and E or W following it shows the proper quadrant. Thus, a properly expressed bearing includes quadrant letters and an angular value. An example is N80°E.\r\n\r\nObservations of Traverse Angles: The methods used in observing angles or directions of traverse lines vary and include:\r\n(1) interior angles,\r\n(2) angles to the right,\r\n(3) deflection angles, and\r\n(4) azimuths.\r\nTraversing by Interior Angles: Interior-angle traverses are used for many types of work, but they are especially convenient for property surveys. Although interior angles could be observed either clockwise or counterclockwise, to reduce mistakes in reading, recording, and computing, they should always be turned clockwise from the Backsight station to the Foresight station. The procedure is illustrated in Fig. 1(a). Angle EAB of Fig. 1(a) was observed at station A, with the Backsight on station E and the foresight at station B.\r\nAngle Misclosure: The angular misclosure for an interior-angle traverse is the difference between the sum of the observed angles and the geometrically correct total for the polygon. The sum (Σ) of the interior angles of a closed polygon should be\r\n\r\nwhere n is the number of sides, or angles, in the polygon. The sum of the angles in a triangle is 180°; in a rectangle, 360°; and in a pentagon, 540°.\r\nSelection of Traverse Stations: Positions selected for setting traverse stations vary with the type of survey. In general, guidelines to consider in choosing them include accuracy, utility, and efficiency. Of course, intervisibility between adjacent stations, forward and back, must be maintained for angle and distance observations. The stations should also ideally be set in convenient locations that allow for easy access. Ordinarily, stations are placed to create lines that are as long as possible. This not only increases efficiency by reducing the number of instrument setups, but it also increases accuracy in angle observations.\r\n\r\nDepartures and Latitudes\r\nThe departure of a course is its orthographic projection on the east-west axis of the survey and is equal to the length of the course multiplied by the sine of its azimuth angle. Departures are sometimes called eastings or westings.\r\nThe latitude of a course is its orthographic projection on the north-south axis of the survey, and is equal to the course length multiplied by the cosine of its azimuth angle. Latitude is also called northing or southing.\r\n\r\nTraverse Adjustment\r\nFor any closed traverse, the linear misclosure must be adjusted (or distributed) throughout the traverse to “close” or “balance” the figure. This is true even though the misclosure is negligible in plotting the traverse at map scale. There are several elementary methods available for traverse adjustment, but the one most commonly used is the compass rule (Bowditch method).\r\nCompass (Bowditch) Rule The compass, or Bowditch, rule adjusts the departures and latitudes of traverse courses in proportion to their lengths. Corrections by this method are made according to the following rules:\r\nTraversing with a Total Station (Example)\r\nFor the traverse ABCDE, the observed interior angles are given in the table below. The fixed azimuth of line AW is 234°17’18\" and the measured angle to the right for EAW is 208°7’36\". It is known that the coordinate of point A is 10,000 Easting and 5,000 Northing. Calculate the coordinates of point B, C, D, and E. Additionally, determine the linear misclosure and precision.\r\n\r\n\r\n\r\nError of Closure:* If the measured bearings and distances are plotted on a sheet of paper, the figure will not close because of error in latitudes (E_L) and error in departures (E_D).\r\n\r\n\r\nLab Task: Traversing\r\nThe purpose of this task is to set a traverse with five stations (A, B, C, D, and E) as presented in previous section using interior angles to determine the angles between traverse lines. Additionally, compute the coordinates of the points of the traverse.Known Information:\r\n1. The fixed azimuth of line AW is 234°17’18\".\r\n2. The coordinate of point A is X = 5,000 Easting and Y = 7,500 Northing.\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-09-16T17:48:54-04:00",
    "input_file": {}
  },
  {
    "path": "posts/2021-09-10-total-station-and-traverse-survey/",
    "title": "Total Station and Traverse Survey",
    "description": "The purposed of this lab is to familiarize students with the TOTAL STATION (TS).  The students will learn how to measure distances and angles using TS.",
    "author": [
      {
        "name": "ECIV 340L, CEE, UofSC",
        "url": {}
      }
    ],
    "date": "2021-09-10",
    "categories": [],
    "contents": "\r\n\r\nContents\r\nTotal Station Introduction\r\nSetting up the Total Station\r\nCentering\r\nLeveling\r\nSurvey Prism Offset:\r\nAzimuth:\r\nNotations:\r\n\r\nField Work\r\nTask 1: Distance and Angle Measurement\r\nTask 2: Field Book Entry of Distance and Angle Measurement\r\n\r\n\r\n\r\n\r\nbody {\r\ntext-align: justify}\r\n\r\n\r\n\r\nRELATED RESOUCES:\r\nLECTURE SLIDES\r\nLEVEL BOOK\r\nFIELD BOOK\r\nDATA FORM\r\nLAB PROCEDURE (FIELD)\r\nDEMO CALCULATION\r\nTotal Station Introduction\r\nIn the past, transits and theodolites were the most commonly used surveying instruments for making angle observations. These two devices were fundamentally equivalent and could accomplish basically the same tasks. Today, the total station instrument has replaced transits and theodolites. Total station instruments can accomplish all of the tasks that could be done with transits and theodolites and do them much more efficiently. In addition, they can also observe distances accurately and quickly. Furthermore, they can make computations with the angle and distance observations and display the results in real time. These and many other significant advantages have made total stations the predominant instruments used in surveying practice today. They are used for all types of surveys including topographic, hydrographic, and construction surveys.\r\n\r\nSetting up the Total Station\r\nCentering\r\nStep 1. Make sure the legs are spaced at equal intervals and the head is approximately level. Set the tripod so that the head is positioned over the survey point. Make sure the tripod shoes are firmly fixed.\r\n\r\nStep 2. Place the instrument on the tripod head. Supporting it with one hand, tighten the centering screw on the bottom of the unit to make sure it is secured to the tripod.\r\n\r\nStep 3. Looking through the optical plummet eyepiece, turn the optical plummet eyepiece to focus on the reticle. Turn the optical plummet focusing ring to focus on the survey point.\r\n\r\nStep 4. Adjust the leveling foot screws to center the survey point in the optical plummet reticle.\r\n\r\nLeveling\r\nStep 1. Center the bubble in the circular level by either shortening the tripod leg closest to the off-center direction of the bubble or by lengthening the tripod leg farthest from the off-center direction of the bubble. Adjust one more tripod leg to center the bubble. Turn the leveling foot screws while checking the circular level until the bubble is centered in the center circle.\r\n\r\nStep 2. Power on the total station.\r\n\r\nStep 3. Center “” in the circular level.\r\n\r\nStep 4. Turn the instrument until the telescope is parallel to a line between leveling foot screws A and B, then tighten the horizontal clamp.\r\n\r\nStep 5. Set the tilt angle to 0° using foot screws A and B for the X direction and leveling screw C for the Y direction.\r\nStep 6. Loosen the centering screw slightly. Looking through the optical plummet eyepiece, slide the instrument over the tripod head until the survey point is exactly centered in the reticle. Retighten the centering screw securely.\r\nStep 7. Confirm that the bubble is positioned at the center of the circular level on the screen. If not, repeat the procedure starting from step 5.\r\nStep 8. When leveling is completed, press [OK] changes to the OBS mode.\r\nSurvey Prism Offset:\r\n−30mm (0.0984 ft)\r\nAzimuth:\r\nAzimuth is defined as a horizontal angle measured clockwise from a north base line. Azimuth has also been more generally defined as a horizontal angle measured clockwise from any fixed reference plane or easily established base direction line.\r\nIn the figure below, the azimuth of line AB is known to be 137° 17’ 00\" from the north. The azimuth of any other line that starts at A, such as AC in the figure, can be found directly using a total station instrument.\r\n\r\nNotations:\r\nTask 1: Distance and Angle Measurement The purpose of Task 1 is to determine the distances of point A, B, and C from Station Z. Additionally, the angles between ZA and ZB, ZB and ZC, and ZC and ZA need to be determined.\r\n\r\nField Work\r\nTask 1: Distance and Angle Measurement\r\n\r\nTask 2: Field Book Entry of Distance and Angle Measurement\r\n\r\n\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-09-10T10:54:48-04:00",
    "input_file": {}
  },
  {
    "path": "posts/2021-09-02-contouring/",
    "title": "Contouring",
    "description": "The purposed of this lab is to learn how to collect elevation data for a region (i.e., parcel of land) and use it to develope contour maps using (1) hand-sketch, (2) ArcGIS software, and (3) TransCAD software",
    "author": [
      {
        "name": "ECIV 340L, CEE, UofSC",
        "url": {}
      }
    ],
    "date": "2021-09-02",
    "categories": [],
    "contents": "\r\n\r\nContents\r\nContouring\r\nContouring in Field\r\nSetup\r\nData Collection\r\n\r\nContouring using ArcGIS\r\nContouring using TransCAD\r\n\r\n\r\nbody {\r\ntext-align: justify}\r\n\r\n\r\n\r\nRELATED RESOUCES:\r\nLECTURE SLIDES\r\nLEVEL BOOK\r\nFIELD BOOK\r\nDATA FORM\r\nLAB PROCEDURE (FIELD)\r\nDEMO CALCULATION\r\nContouring\r\nContouring needs the determination of elevation of various points on the ground and at the same time the horizontal positions of those points should be fixed. If the total station is used both horizontal and vertical controls can be achieved from the same instrument.\r\nContouring in Field\r\nQ: Draw contour of 98 ft and 99 ft?\r\nSetup\r\n\r\nData Collection\r\nX\r\nY\r\nElevation (Z) ft\r\nX\r\nY\r\nElevation (Z) ft\r\nX\r\nY\r\nElevation (Z)\r\nX\r\nY\r\nElevation (Z)\r\nA\r\n1\r\n99.50\r\nB\r\n1\r\n97.60\r\nC\r\n1\r\n96.25\r\nD\r\n1\r\n94.75\r\nA\r\n2\r\n97.60\r\nB\r\n2\r\n99.25\r\nC\r\n2\r\n98.60\r\nD\r\n2\r\n99.65\r\nA\r\n3\r\n98.75\r\nB\r\n3\r\n99.20\r\nC\r\n3\r\n97.75\r\nD\r\n3\r\n99.75\r\nA\r\n4\r\n100.75\r\nB\r\n4\r\n99.60\r\nC\r\n4\r\n99.90\r\nD\r\n4\r\n98.20\r\nContouring using ArcGIS\r\nStep 1:\r\nOpen ArcMap and activate “3D Analyst” and “Spatial Analyst” extensions. Click on customize > extensions and check two boxes like the following.\r\n\r\nStep 2:\r\nUse the data file named “elevdemo.dbf” (download from Blackboard). Then click on “Catalog” icon and go to the file location.\r\n\r\nStep 3:\r\nRight click on the file and choose Create Feature Class > From XY Table.\r\n\r\nStep 4:\r\nSpecify the location for the output “XYelevdemo.shp” file. Then click OK.\r\n\r\nStep 5:\r\nSelect the data “XYelevdemo.shp” file and click on “Add”. Ignore any warning.\r\n\r\nStep 6:\r\nOpen ArcToolbox; click on Geoprocessing > ArcToolBox. Then go to Create TIN (triangulated irregular network) option. Follow the steps below.\r\n\r\nStep 7:\r\nClick on “Create TIN” and follow the steps below and click OK.\r\n\r\nStep 8:\r\nThe TIN should look like the following. Export the TIN as a pdf file.\r\n\r\nStep 9:Click on 3D Analyst Tools > Triangulated Surface > Surface Contour.\r\n\r\nStep 10:\r\nFollow the steps below and click OK. This step is using 5 feet contour interval, you can choose any distance.\r\n\r\nStep 11:\r\nThe generated contour should look like the following. Export it as a pdf file.\r\n\r\nContouring using TransCAD\r\nStep 1:\r\nChoose File > Open, then open the “elevdemo.dbf.” Save the file as “elevdemo.dbd.”\r\nStep 2:\r\nChoose Tools > 3D > Terrian Analysis Toolbar to display the Terrain Analysis dialog box.\r\nStep 3:\r\nChoose All Features from the Based On drop-down list, USGS_NED_O from the Field drop-down list, and Feet from the Display Units drop-down list.\r\nStep 4:\r\nClick OK. TransCAD displays the Terrain Analysis Toolbar.\r\nStep 5:\r\nClick on the first option in the Terrain Analysis Toolbar to activate the Calculate Spot Data tool, and click anywhere on the map. The estimated elevation for the point where you click is shown in the toolbox.\r\nStep 6:\r\nClick on the second option in the Terrain Analysis Toolbar to activate the Show Profile tool, and click on two locations on the map. TransCAD adds a line annotation to the map and creates a new figure window showing the profile along the line as an area chart.\r\n\r\nStep 7:\r\nClick on “Generate Contours” in the Terrain Analysis Toolbar to display the Contour layer dialogue box. Follow the steps shown below.\r\n\r\nStep 8:\r\nSave the Contour Layer File. Show the contour labels. Then print the contour as a pdf file.\r\n\r\n \r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-09-03T11:19:32-04:00",
    "input_file": {}
  },
  {
    "path": "posts/2021-08-19-distance-measurement-and-leveling/",
    "title": "Distance and Elevation Measurements",
    "description": "The purposed of this lab is to learn how to take linear and elevation measurements and record data in the field and level book.",
    "author": [
      {
        "name": "ECIV 340L, CEE, UofSC",
        "url": {}
      }
    ],
    "date": "2021-08-27",
    "categories": [],
    "contents": "\r\n\r\nContents\r\nDistance and Elevation Measurement\r\nMethods\r\nLinear Measurements\r\nTaping\r\nPacing\r\n\r\nElevation Measurements\r\nLeveling\r\nDifferential Leveling\r\n\r\n\r\n\r\n\r\nbody {\r\ntext-align: justify}\r\n\r\n\r\n\r\nRELATED RESOUCES:\r\nLECTURE SLIDES\r\nDEMO CALCULATION\r\nLEVEL BOOK\r\nFIELD BOOK\r\nDATA FORM\r\nLAB PROCEDURE (FIELD)\r\nDistance and Elevation Measurement\r\nDistance measurement is generally regarded as the most fundamental of all surveying observations. In traditional ground surveys, even though many angles may be read, the length of at least one line must be measured to supplement the angles in locating points. In plane surveying, the distance between two points means the horizontal distance.\r\nIf the points are at different elevations, the distance is the horizontal length between vertical lines at the points. Lengths of lines may be specified in different units. In the United States, the foot, decimally divided, is usually used although the meter is becoming increasingly more common. Geodetic surveys, and many highway surveys employ the meter. In architectural and machine work, and on some construction projects, the unit is a foot divided into inches and fractions of an inch.\r\nMethods\r\nLinear Measurements\r\nIn surveying, linear measurements have been obtained by many different methods. These include:\r\npacing,\r\nodometer readings,\r\noptical rangefinders,\r\ntacheometry (stadia),\r\nsubtense bars,\r\ntaping,\r\nelectronic distance measurement (EDM),\r\nsatellite systems, and others.\r\nOf these, surveyors most commonly use taping, EDM, and satellite systems today. In particular, the satellite-supported Global Navigation Satellite Systems (GNSS) are rapidly replacing all other systems due to many advantages, but most notably because of their range, accuracy, and efficiency.\r\nTaping\r\n\r\nPacing\r\nDistances obtained by pacing are sufficiently accurate for many purposes in surveying, engineering, geology, agriculture, forestry, and military field sketching. Pacing is also used to detect blunders that may occur in making distance observations by more accurate methods.\r\nPacing consists of counting the number of steps, or paces, in a required distance. The length of an individual’s pace must be determined first. This is best done by walking with natural steps back and forth over a level course at least 300 ft long and dividing the known distance by the average number of steps. For short distances, the length of each pace is needed, but the number of steps taken per 100 ft is desirable for checking long lines.\r\nPacing is one of the most valuable things learned in surveying, since it has practical applications for everybody and requires no equipment. If the terrain is open and reasonably level, experienced pacers can measure distances of 100 ft or longer with an accuracy of 1/50 to 1/100 of the distance.\r\nElevation Measurements\r\nLeveling\r\nLeveling is the general term applied to any of the various processes by which elevations of points or differences in elevation are determined. It is a vital operation in producing necessary data for mapping, engineering design, and construction. Leveling results are used to (1) design highways, railroads, canals, sewers, water supply systems, and other facilities having grade lines that best conform to existing topography; (2) lay out construction projects according to planned elevations; (3) calculate volumes of earthwork and other materials; (4) investigate drainage characteristics of an area; (5) develop maps showing general ground configurations; and (6) study earth subsidence and crustal motion.\r\nDefinitions\r\n\r\nLeveling: The process of finding elevations of points or their differences in elevation.Benchmark (BM): A relatively permanent object, natural or artificial, having a marked point whose elevation above or below a reference datum is known or assumed.Backsight (BS): A sight taken to the level rod held at a point of known elevation (either a BM or TP).Height of instrument (HI): The elevation of the line of sight of the telescope.Foresight (FS): A sight taken on any point to determine its elevation.\r\nDifferential Leveling\r\nDifferential leveling is the process of measuring vertical distances from a known elevation point to determine elevations of unknown points.\r\n\r\nThe elevation of point A is 100 feet. Using this information determine the elevation of point B.\r\nSteps 1:\r\n\r\nStep 2:\r\n\r\nStep 3:\r\n\r\nStep 4:\r\n\r\nStep 5:\r\n\r\nStep 6:\r\n\r\nStep 7:\r\n\r\nThe elevation of point B = 105.92 feet.\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-08-26T16:49:32-04:00",
    "input_file": {}
  },
  {
    "path": "posts/2021-08-20-first-class/",
    "title": "ECIV 340L Introduction: Fall 2021",
    "description": "First Class of Fall 2021",
    "author": [
      {
        "name": "ECIV 340L, CEE, UofSC",
        "url": {}
      }
    ],
    "date": "2021-08-20",
    "categories": [],
    "contents": "\r\n\r\nbody {\r\ntext-align: justify}\r\nRELATED RESOUCES:\r\nLECTURE SLIDES\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-08-20T11:36:41-04:00",
    "input_file": {}
  }
]
