[
  {
    "path": "posts/2021-10-28-vehicle-arrival-study/",
    "title": "Vehicle Arrival Study",
    "description": {},
    "author": [
      {
        "name": "ECIV 340L, CEE, UofSC",
        "url": {}
      }
    ],
    "date": "2021-11-05",
    "categories": [],
    "contents": "\r\n\r\nContents\r\nINTRODUCTION\r\nEQUIPMENT\r\nDATA COLLECTION\r\nDATA ANALYSIS\r\n\r\n\r\nbody {\r\ntext-align: justify}\r\n\r\n\r\n\r\nRELATED RESOUCES:\r\nLECTURE SLIDES\r\nDATA FORM\r\n`DEMO CALCULATION\r\nINTRODUCTION\r\nMany theoretical analyses of intersections assume that vehicles arrive at an intersection in a random fashion. The ability to verify that traffic arrives in a statistically random pattern is of great value to the traffic engineer. For example, procedures from the Highway Capacity Manual for the analysis of signalized intersections require the analyst to state whether the traffic stream follows a random pattern or is affected by some other source, such as a signal upstream from the approach. The Poisson distribution is a simple, random, statistical distribution. It is referred to as a counting distribution used to predict the number of occurrences of an event within a certain interval. Often, when used in traffic engineering, the occurrences are vehicle arriving, and the time interval is cycle length. The Poisson equation can be used to estimate the number of vehicles arriving at an intersection within a given time span so that the amount of green needed to process a predicted number of vehicles can be estimated. In conjunction with the saturation flow rate, the Poisson distribution is used to estimate the number of signal cycles that will successfully process the approach traffic and the number that can be expected to fail. Also, when left-turning traffic is of concern, the length of a left-turn lane can be estimated by using this random distribution. This lab session has two objectives. First, it provides a procedure for estimating the randomness of the traffic stream by comparing field measurements to computed theoretical values. Secondly, it demonstrates how a statistical distribution can be used in conjunction with field-measured saturation flow rates, startup delays, and volumes to calculate the minimum green time for an approach to an intersection.\r\nEQUIPMENT\r\nThe equipment list for data collection procedure is a stopwatch (cell phone) and note-taking materials.\r\nDATA COLLECTION\r\nSelect a signalized intersection that has sufficient traffic to accomplish the session\r\nThe student group must first decide which lanes or lane groups should be measured. A lane group can be thought of as one lane or group of lanes from which drivers can complete the same move during the same phase. For instance, an exclusive left-turn and a combined right-turn and through-lane are examined as two separate lane groups. The Poisson distribution would be applied separately for each of the two lane groups. However, a combined left-turn and through-lane and a combined right-turn and through-lane approach controlled by a single-signal phase would be one lane group, and the lab session would look at the distribution for the entire lane group. Each of the lanes should have sufficient traffic for 0 to 6 or more vehicles to arrive per twenty-second interval. This will provide a sufficient number of data points for the analysis.\r\nFor 100 consecutive twenty-second intervals, record the number of vehicles arriving at the intersection during each interval\r\nThe interval length will affect the quality of the results and should be chosen carefully. The twenty-second interval offers both enough observations and a reasonable time in the field. An interval shorter than 15 seconds would yield very few points for the probability curve and not allow a significant comparison to the theoretical Poisson distribution. On the other hand, longer interval lengths necessitate longer and impractical field-data collection periods. The data collection will be done for each of the lanes separately but can be accomplished concurrently. The student group can accomplish this task by designating a point on the approach to the intersection for determining whether a vehicle has arrived. This point is best chosen upstream of the intersection but before the point representing the maximum queue for that lane. This will allow vehicles arriving at the intersection to be counted without interference from the queue of vehicles waiting at the intersection when the signal is red. In many instances, the best location for this point will be the beginning of the separate left-turn lane. A data collection form is attached to this handout.\r\nCheck your work before leaving the field\r\nBefore leaving the field, the data collection form should be checked to see that all field data have been collected correctly. Any unusual observations should be listed as comments.\r\nDATA ANALYSIS\r\nSummarize field data on form provided\r\nA Poisson Distribution Data Summary Form is attached to this handout. Key to the understanding of the Poisson distribution is to take great care in the treatment of the collected materials; small errors can have a serious effect on results. For the 100 observations recorded, sum those having the same number of vehicles observed, and enter it in the corresponding row. When complete, sum the values in Column 2 and check to see that the total equals the number of intervals observed. Next, calculate the number of vehicles observed. Multiply the values in Column 1 by the values in Column 2, and enter the product in Column 3. The sum of the values in Column 3 is the total number of vehicles arriving during the observation period. Divide this total by the total number of intervals observed to yield the average number of vehicles arriving during the 20-seconds interval. This is the average arrival rate (m or AAR) and will be used in the Poisson equation to calculate theoretical probabilities.\r\nCalculate observed probabilities\r\nAn assessment of traffic randomness requires a comparison of the observed distribution of arrivals to the theoretical distribution of arrivals. To do this, it is necessary to compute the observed probabilities. The observed probability is a measure of the likelihood that an observer randomly choosing a 20-second interval would witness a particular number of vehicles arriving. The values are a result of dividing the observed frequency for each level by the total number of observed intervals, or Column 2 divided by the sum of Column 2. The cumulative probability represents the likelihood a group will count a particular number of vehicles, or less, during a randomly selected interval. It is computed by adding all of the observed probabilities for that value and all lower values.\r\nCompute theoretical Poisson probabilities\r\nOnce the actual cumulative probability has been computed, the theoretical values are calculated using the Poisson equation. If the distribution of arrival is a random one, then the theoretical and observed values should be close. The form of the Poisson equation to be used is as follows:\\(Pr(X)= \\frac{m^xe^{-m}}{x!}\\)\r\nwhere m is the average arrival rate, x is the number of vehicles expected to arrive and the constant e is the base for natural logarithms. For instance, the computed probability of exactly two vehicles arriving during an interval is \\(0.2225\\), or \\(22.25%\\), and is calculated using \\(m = 1.24\\) vehicles per interval, and x = 2 vehicles. The cumulative Poisson probabilities in the last column are calculated, similarly to the cumulative observed probabilities, by adding all values up to, and indicating, the row of interest. The probability that two or fewer vehicles will arrive is theoretically \\(0.2894\\) plus \\(0.3588\\) plus \\(0.2225\\) or \\(0.8707\\).\r\nCompare observed probabilities to Poisson probabilities The statistically valid method to compare field observations to a theoretical distribution is to apply a Chi-squared test, the application of which is demonstrated here. The question to be answered is whether the collected data indicate that the Poisson equation is a good indicator of how vehicles arrive at the intersection. Also, recognizing the limited number of data gathered, would it be unreasonable to use a Poisson distribution to forecast future events, such as the change in the capacity of an approach because of a change in green time or to find the length of a turning lane? Comparing cumulative-observed and cumulative-theoretical probabilities in the example data summary yield some interesting results. For this example, the values compare favorably, especially at the higher levels. The predicted values are within three percent of the observed values. So, it appears reasonable to use the Poisson equation to predict arrivals on this approach. However, the Goodness-of-Fit must be applied before proceeding. In a nutshell, the Goodness-of-Fit test identifies significant differences between the expected values and the observed values by computing the statistic Chi-squared, \\(\\chi^2\\), and comparing the computed value to the standard \\(\\chi^2\\) value. The following equation is used for the computation: \\[\\chi^2 = \\sum_{i=1}^k \\frac{(o_i-e_i)^2}{e_i}\\]\r\nwhere the symbols o_i and e_i represent the observed and expected frequencies, respectively, for the i-th cell. The decision criteria should not be used if the expected frequency of a cell is less than five. The observed and expected frequencies computed using the Poisson equation are shown below. The Goodness-of-Fit test will be applied to this data to determine if the Poisson distribution properly reflects driver behavior on this approach. If the Poisson distribution is a good estimator of the arrivals, then the tabular or theoretical Chi-squared will be greater than the computed Chi-squared. In order to identify the proper Chi-squared, the number of degrees of freedom must be found. By definition, the number of degrees of freedom in a Chi-square goodness-of-fit test is equal to the number of cells minus 1. Computing the \\(\\chi^2\\) using the stated equation yields the following:\r\nData Summary Number of Vehicles Observed Frequency Computed Frequency:\r\n# veh\r\nObserved Freq.\r\nComputed Freq.\r\n0\r\n34\r\n28.9\r\n1\r\n34\r\n35.9\r\n2\r\n16\r\n22.2\r\n3\r\n9\r\n9.2\r\n4\r\n5\r\n2.9\r\n5\r\n1\r\n0.7\r\n6\r\n1\r\n0.2\r\nThe student will notice that the values for 3, 4, 5, and 6 vehicles were combined because the number of observations (computed frequency) in the cells was less than 5.\r\n\\(\\chi^2 =\\frac{(34-28.9)^2}{28.9}+\\frac{(34-35.9)^2}{35.9}+\\frac{(16-22.2)^2}{22.2}+\\frac{(16-13)^2}{13}\\)\r\n\\(\\chi^2=3.424\\)\r\nFor this example, the average arrival rate was the only quantity obtained from the observed data used to compute the Poisson frequencies. Therefore, the number of degrees of freedom for this example is \\(4 - 1 = 3\\). From the table, \\(\\chi^2_{0.05}=7.81\\) and \\(3.424\\ \\le\\ 7.81\\), so it can be concluded that the Poisson distribution provides a good fit for the distribution of arrival rates.\r\nCalculate maximum arrivals The next step in the analysis focuses on the application of the Poisson equation to the identification of the capacity of a lane group. The values presented will be hypothetical, but the reader may wish to refer to the saturation flow rate. Should a quick determination of an existing approach be desired, then the length of the cycle and the length of green time would be useful. Note that many signal timing procedures exist, and the application of a Poisson distribution is but one of them. Determining the capacity of an existing lane group, or the minimum green time required, can be accomplished using the Poisson equation. It is used to determine the highest number of vehicles that may be expected to arrive during a signal cycle. Knowing this number, the saturation flow rate and startup delay can be used to compute the minimum green time needed to process the traffic. First, however, the analyst must determine how often the signal should be able to process all of the demand. Since it is usually impossible to time a signal to process all levels of traffic all the time, a level of acceptance is chosen. For this example, the signal should exhibit sufficient green time to process the traffic for 9 out 10 cycles. The Poisson equation can be used to calculate the maximum number of vehicles expected to arrive during 90% of the cycles. So, timing the green-signal time to process this traffic would result in the green time being insufficient only 10% of the time. Calculating the maximum number of vehicles expected to arrive in 9 of 10 cycles is computed using the cumulative Poisson distribution. If the cycle length is 60 seconds and the demand volume is 180 vehicles per hour, then the average arrival rate is (180)(60)/3600 = 3 vehicles per cycle. Now, let us consider the class example. Calculating the probabilities of exactly 0, 1, 2, … vehicles arriving during the cycle and summing the values, 3 is the maximum number of vehicles expected. The computed probability of having 3, or less, vehicles arriving during the cycle is 0.963 or 96.3%. Therefore, allocating sufficient green time to process three vehicles should allow the approach to process all of the traffic 96.3% of the time.\r\nCalculate minimum green time The minimum green time can be calculated using the saturation flow rate and startup delay for the approach. For this example, it may be assumed that the saturation flow rate is 1800 vehicles per hour of green time and the startup delay is 3 seconds. Using these values, the minimum green time is calculated by the equation 3 + (3600/1800) X = G, where X equals the number of vehicles which must be processed and G is the minimum green time needed to move the traffic. Substituting X = 3 vehicles, the equation yields a green time of 9 seconds.\r\nSummarize and draw conclusions The student group should summarize the findings and draw conclusions from the effort. Questions to be addressed are:\r\nDoes the Poisson equation provide a good indication of driver behavior at this intersection?\r\nCan it be used to predict the minimum green time needed?\r\nShould observed frequencies be used for analysis at this location rather than the Poisson theoretical frequencies?\r\nDoes this effort indicate that statistical functions are useful in traffic engineering?\r\n\r\n",
    "preview": {},
    "last_modified": "2021-11-05T11:51:13-04:00",
    "input_file": {}
  },
  {
    "path": "posts/2021-11-11-transportation-modeling-with-transcad/",
    "title": "Transportation Modeling with TransCAD",
    "description": {},
    "author": [
      {
        "name": "ECIV 340L, CEE, UofSC",
        "url": {}
      }
    ],
    "date": "2021-11-05",
    "categories": [],
    "contents": "\r\n\r\nContents\r\nINTRODUCTION\r\nPart I: Travel Demand Modeling\r\nTrip Generation (Production)\r\nTask 1: Generating Productions by Cross-Classification\r\nTask 2: Estimating and Applying a Zonal Regression Model\r\nTask 3: Estimating a Logit Model of Work Trip Production\r\n\r\nTrip Generation (Attraction)\r\nTrip Distribution\r\nTask 4. Applying a Growth Factor Model\r\nTask 5: Applying a Gravity Model\r\n\r\nMode Choice\r\nDiscrete Choice Models\r\nTask 6: Estimating an MNL Model\r\nTask 7: Applying an MNL Model on a Matrix\r\nTask 8: Estimating a NL Model\r\nTask 9: Applying a NL Model on a Matrix\r\n\r\nTraffic Assignment\r\nUser Equilibrium (UE)\r\nSystem Optimum (SO)\r\nTask 10: Performing a User Equilibrium Traffic Assignment\r\nTask 11: Performing Assignment with Critical Link Analysis\r\n\r\nMulti-Modal Multi-Class Assignment (MMA)\r\nTask 12: Performing Multi-Modal Assignment\r\n\r\n\r\nPart II: Network and Route Analysis\r\nTask 13: Solving a Vehicle Routing Problem\r\nNetwork Flow Models\r\nTask 14: Solving a Transportation Problem and Displaying Output Flow\r\n\r\nFacility Location Models\r\nTask 15: Solving a Facility Location Problem\r\n\r\n\r\n\r\n\r\nbody {\r\ntext-align: justify}\r\n\r\n\r\n\r\nRELATED RESOUCES:\r\nLECTURE SLIDES\r\nDATA FORM\r\n`DEMO CALCULATION\r\nINTRODUCTION\r\nThe purpose of this lab session is to perform travel demand modeling and logistics analysis using TransCAD. First, you need to download the demo files (TransCAD_demo.zip) from Blackboard. Then, open the TransCAD 8.0 (Academic 64-bit).\r\nPart I: Travel Demand Modeling\r\nTrip Generation (Production)\r\nThe goal of trip generation is to predict the number of trips that are generated by and attracted to each zone in a study area. This is only concerned with the number of trips that start and end in each zone, and not with making connections between origins and destinations of trips.\r\nThere are three primary tools that are used in modeling trip production:\r\nCross-Classification:\r\nCross-classification methods separate the population in an urban area into relatively homogeneous groups based on certain socio-economic characteristics. Then, average trip production rates per household or individual are empirically estimated for each classification. This creates a lookup table that may be used to forecast trip productions.\r\nRegression Models:\r\nTwo types of regressions are commonly used. The first uses data aggregated at the zonal level, with average number of trips per household in the zone as the dependent variable and average zonal characteristics as the explanatory variables. The second uses disaggregated data at the household or individual level, with the number of trips made by a household or individual as the dependent variable and the household and personal characteristics as the explanatory variables.\r\nDiscrete Choice Models:\r\nDiscrete choice models use disaggregate household or individual level data to estimate the probability with which any household or individual will make trips. The outcome can then be aggregated to predict the number of trips produced.\r\nTask 1: Generating Productions by Cross-Classification\r\nStep 1. Choose File > Open Workspace and open the workspace CrossClassification.wrk. TransCAD displays a map of Vermont zones and a cross-classification table.\r\nStep 2. Choose Planning > Trip Productions > Cross-Classification to display the Cross-Classification box.\r\nStep 3. Choose MCD from the Input Data drop-down list.\r\nStep 4. Choose All Zones from the Using drop-down list and Vmt_crcl from the Trip Rate Table list.\r\nStep 5. Choose all three trip purposes that are shown in the Rate Fields scroll list.\r\nStep 6. Click Choose Segments to display the Choose Zone/Subzone fields dialog box.\r\nStep 7. Click Households in the Available Fields scroll list and click Add>>.\r\nStep 8. Click OK to return to the Cross-Classification dialog box.\r\nStep 9. Choose \\[AUTO/HH\\] from the drop-down list in the Avg Car/HH column and \\[INC/HH\\] from the drop-down list in the Avg Inc/HH column.\r\nStep 10. Click OK to display the Output File Settings dialog box.\r\nStep 11. Type “First Name-TG-CC” as the Output Table file name in the Short File Name column and click OK. TransCAD computes the productions for all zones and all purposes and displays a dataview of the cross-classification results in a joined view.\r\nStep 12. Click Close to close the dialog box and scroll to the far right of the dataview to see the trip productions.\r\nStep 13. Choose File > Close All to close the map and dataviews.\r\nTask 2: Estimating and Applying a Zonal Regression Model\r\nStep 1. Choose File > Open and open the binary file TG_ZNREG.BIN. This database contains the census data on each tract in Nassau County, New York.\r\nStep 2. Choose Statistics > Model Estimation to display the Model Estimation dialog box.\r\nStep 3. Click the Regression radio button.\r\nStep 4. Choose \\[Work Trips Per HH\\] from the Dependent Var drop-down list.\r\nStep 5. Click Independent Variables to display the Choose Independent Variables dialog box.\r\nStep 6. Control click on \\[People Per HH\\], \\[Age\\<=5 Per HH\\], \\[25+ College Grad %\\], and \\[Veh Per HH\\] in the Available Fields scroll list and click add.\r\nStep 7. Click OK to return to the Model Estimation dialog box.\r\nStep 8. Click Estimate to estimate the model.\r\nStep 9. Click Save Model to display the Save Model As dialog box.\r\nStep 10. Type “First Name-TG-R” as the file name and click Save.\r\nStep 11. TransCAD produces a .mod file (called First Name-TG-R.mod) that contains the estimated parameters of the regression equation, including goodness-of-fit measures, estimates of the coefficients, and t-statistics.\r\nStep 12. Click Close to close the Model Estimation dialog box.\r\nStep 13. Choose Planning > Trip Productions > Apply a Model.\r\nStep 14. Choose the model file First Name-TG-R.mod and click Open to display the Forecast dialog box.\r\nStep 15. Choose TG_ZNREG from the Apply To drop-down list.\r\nStep 16. Choose \\[Forecasted WTrips\\] from the Results in drop-down list.\r\nStep 17. Click the Regression radio button.\r\nStep 18. Click OK. TransCAD applies the model to each record, stores the forecasted variable in the field \\[Forecasted WTrips\\] of the table TG_ZNREG, and displays the Results Summary dialog box.\r\nStep 19. Click Close.\r\nStep 20. Scroll to the far right to see the results. Step 21. Choose File > Close to close the dataview.\r\nTask 3: Estimating a Logit Model of Work Trip Production\r\nStep 1. Choose File > Open and open the binary file Survey.bin. This database contains a subset of the fields from the PUMS person records for Delaware.\r\nStep 2. Choose Statistics > Model Estimation to display the Model Estimation dialog box.\r\nStep 3. Click the Binary Logit radio button.\r\nStep 4. Choose \\[Worked Last Week?\\] from the Dependent Var drop-down list.\r\nStep 5. Click Independent Variables to display the Independent Variables dialog box.\r\nStep 6. Control click on \\[Age over 16 ?\\] , \\[Age over 65 ?\\] , \\[Male ?\\] , and \\[Non-White\\] in the Available Fields scroll list, and click Add.\r\nStep 7. Click OK.\r\nStep 8. Click Estimate to estimate the model.\r\nStep 9. Click Save Model to display the Save Model As dialog box.\r\nStep 10. Type “First Name-TG-LM” as the File Name and click Save.\r\nStep 11. TransCAD produces a .mod file (called First Name-TG-LM.mod) that contains the estimated parameters of the regression equation, writes the results to the master report file, including goodness-of-fit measures, estimates of the coefficients, and t-statistics.\r\nStep 10. Click Close to close the Model Estimation dialog box.\r\nStep 12. Choose File > Close to close the dataview.\r\nTrip Generation (Attraction)\r\nIn many ways, estimating trip attractions is similar to estimating trip productions because the problem is the same: predicting the number of trips attracted by relating the number or frequency of trips to the characteristics of the individuals, the zone, and the transportation network. Thus, the three methods described above may also be used to estimate the number of trips attracted to a zone.\r\nTrip Distribution\r\nTrip distribution models are used to predict the destination choices of trip makers. Usually, in trip distribution a new flow matrix is forecasted based on estimates of future productions and attractions and estimates of the costs of travel between origins and destinations.\r\nTrip distribution models can be applied at either an aggregate or a disaggregate level. Aggregate trip distribution models are typically used to predict flows between origin and destination zones. Three categories of aggregate trip distribution methods predominate in urban transportation planning:\r\nGrowth Factor Methods:\r\nThese involve scaling an existing matrix by applying multiplicative factors to matrix cells. These methods are usually encountered when there is no information available concerning the network interzonal distances, travel times, or generalized costs.\r\nGravity Models:\r\nThe typical inputs include one or more flow matrices, an impedance matrix reflecting the distance, time, or cost of travel between zones, and estimates of future levels productions and attractions. The gravity model explicitly relates flows between zones to interzonal impedance to travel.\r\nDestination Choice Models:\r\nThese generally take the form of discrete choice models that evaluate utility functions for various potential destinations and ascribe probabilities to the same. The utilities can be a function of destination zone attributes as well as origin-destination skims.\r\nTask 4. Applying a Growth Factor Model\r\nStep 1. Choose File > Open Workspace and open the workspace DistributionApplyGrowthFactor.WRK. A map of Utown and an O-D matrix are displayed.\r\nStep 2. Choose Planning > Trip Distribution > Growth Factor Method to display the Growth Factor Balancing dialog box.\r\nStep 3. Choose UTOWN Base OD from the Matrix File drop-down list.\r\nStep 4. Choose Production from the Constraint Type radio list.\r\nStep 5. Check the box next to the HBW matrix.\r\nStep 6. Click on the cell in the Production column and choose \\[HBW_P 2000\\] from the drop-down list.\r\nStep 7. Click OK to display the Output File Settings dialog box.\r\nStep 8. Type “First Name-TD-GF” as the file name in the Short File Name cell and click OK. TransCAD applies the growth factor model and displays the Results dialog box.\r\nStep 9. Click Close. TransCAD displays the Results Summary dialog box.\r\nStep 10. Click Close. TransCAD displays the Growth Factor Balanced (HBW) matrix.\r\nStep 11. Choose File > Close All to close all of the windows.\r\nTask 5: Applying a Gravity Model\r\nStep 1. Choose File > Open Workspace and open the workspace DistributionApplyGravity.WRK. A map and a friction factor matrix are displayed.\r\nStep 2. Choose Planning > Trip Distribution > Gravity Application to display the Gravity Application box.\r\nStep 3. Choose TAZ from the Table drop-down list, FRICTION FACTORS from the FF Table drop-down list, TIME from the FF Time drop-down list, Doubly from the Constraint drop-down list, Shortest Path from the Impedance Matrix drop-down list, and None from the FF Matrix and K Matrix drop-down lists.\r\nStep 4. Change the name of the Purpose 1 purpose by typing “HBW” in the cell in the Purpose row. HBW_P is automatically chosen in the Production row and HBW_A is automatically chosen in the Attraction row.\r\nStep 5. Make the following changes to the HBW purpose: - Click on the cell in the Method row and choose Gamma from the drop-down list. - Type “20” in the Iteration row. This limits the procedure to a maximum of 20 iterations for this trip purpose. - Type 28507 for the value of a, 0.02 for the value of b, and 0.123 for the value of c. - Verify that Shortest Path - FF_Time is the chosen field in the Impedance Core row.\r\nStep 6. Click “plus sign” to add a second purpose.\r\nStep 7. Change the name of the new purpose to “HBNW.” HBNW_P is automatically chosen in the Production row and HBNW_A is automatically chosen in the Attraction row.\r\nStep 8. Make the following changes to the HBNW purpose: - Click on the cell in the Method row and choose Inverse from the drop-down list. - Type 1.4 for the value of b. - Verify that Shortest Path - FF_Time is the chosen field in the Impedance Core row.\r\nStep 9. Click “plus sign” to add a third purpose.\r\nStep 10. Change the name of the new purpose to “NHB.” NHB_P is automatically chosen in the Production row and NHB_A is automatically chosen in the Attraction row.\r\nStep 11. Make the following changes to the NHB purpose: - Click on the cell in the Method row and choose Table from the drop-down list. - Click on the cell in the F Factor row and choose NHB_FF from the drop-down list. - Verify that Shortest Path - FF_Time is the chosen field in the Impedance Core row.\r\nStep 12. Click OK to display the Output File Settings dialog box.\r\nStep 13. Type “First Name-TD-GM” as the file name in the Short File Name cell and click OK. TransCAD evaluates the three models, displays a Results dialog box stating that all three models converged.\r\nStep 14. Click Close. TransCAD displays the Results Summary dialog box.\r\nStep 15. Click Close. TransCAD displays a matrix view containing the results.\r\nStep 16. Choose File > Close All to close all of the windows.\r\nMode Choice\r\nMode choice models are used to analyze and predict the choices that individuals or groups of individuals make in selecting the transportation modes that are used for particular types of trips. Typically, the goal is to predict the aggregate share or absolute number of trips made by mode for each origin-destination pair. Mode choice models may also be applied on disaggregate lists of individuals and are often employed in Activity-Based Models. The modeling concepts underlying mode choice models may also be applied to predict other choices and shares such as household auto ownership splits, time of day choice, etc. The mode choice component of a travel demand model is estimated using individual-level data obtained from a survey, and forecasts are subsequently based upon aggregate, zonal segment level explanatory variables.\r\nDiscrete Choice Models\r\nDiscrete choice models are in many respects a substitute for regression models when the dependent variable is qualitative or categorical rather than continuous. Discrete choice models are formulated as stochastic models, in which the probability that a particular response is observed is a function of a set of explanatory variables. There are a variety of functional forms that can be proposed for the explanation of discrete choice. The Multinomial Logit (MNL) and Nested Logit (NL) models are used extensively.\r\nMultinomial Logit (MNL) Model\r\nMNL involves a decision-maker choosing exactly one alternative from a set of available discrete alternatives. For example, the figure below illustrated a mode choice situation in which individuals choose one of Drive Alone, Carpool or Bus to make certain type(s) of trips:\r\nTask 6: Estimating an MNL Model\r\nStep 1. Choose File > Open Workspace and open the workspace ModeChoiceEstimation.wrk.\r\nStep 2. Choose Planning > Mode Split > Logit Model Estimation to open the Logit Model Estimation box.\r\nStep 3. Click the Load button and select the model file MultinomialLogitModelEstimation.mdl.\r\nStep 4. Click the Estimate tab and enter an output file name.\r\nStep 5. Click Save and select a file name to save the model.\r\nStep 6. Click Run. TransCAD estimates the MNL model, reports the results in a report form, and displays the Results Summary dialog box.\r\nStep 7. Click Close. TransCAD opens the Load Confirmation dialog box. Click Yes.\r\nStep 8. Click the Utilities tab. The Coefficient column now contains the new estimated parameters.\r\nStep 9. Double-click on the nodes in the tree view window to see the estimated ASC values. Step 10. Choose File > Close All to close all the windows.\r\nTask 7: Applying an MNL Model on a Matrix\r\nStep 1. Choose File > Open Workspace and open the workspace ModeChoiceAggregateApplication.wrk.\r\nStep 2. Choose Planning > Mode Split > Logit Model Application to open the Logit Model Application box.\r\nStep 3. Click the Load button and select the model file MultinomialLogitAggregateModel.mdl.\r\nStep 4. Click the Apply tab and select additional outputs by checking “Output Utility Values” box.\r\nStep 5. Check the “Open Outputs” box to ensure that the output files are opened after the model has been applied.\r\nStep 6. Click Run.\r\nStep 7. Click Yes in the Confirmation dialog box to save the changes, type “First Name-MC-MNL” as the file name and click Save. The Mode Choice Model Application Outputs dialog box is displayed with file names for each of the desired outputs.\r\nStep 8. Check the Overwrite All Files box and click OK. TransCAD applies the Multinomial Logit model, reports the results in a report form, and displays the Results summary dialog box.\r\nStep 9. Click Close. TransCAD opens the Utility, Probability and Applied Totals matrices. Step 10. Choose File > Close All to close all of the windows.\r\nNested Logit (NL) Model\r\nWhen dealing with choice models that include several alternatives, there often exist natural groupings of alternatives and/or a natural hierarchy to the decision being made. A nested logit model is often represented using a tree structure, which visually represents groupings or hierarchies of the choice alternatives. For example, in mode choice, the tree may be:\r\nIn this case, the decision process can be thought of as occurring at the two levels. First, the traveler decides whether to take transit or auto. If transit is chosen, the traveler further decides whether to take the bus or light rail. Similarly, if auto is chosen, the traveler decides whether to drive alone or carpool. However, note that it is in fact a join decision, in that whether a traveler chooses transit or auto depend on the characteristics of the lower level alternatives. The nested logit model provides a mathematical representation of this joint decision.\r\nTask 8: Estimating a NL Model\r\nStep 1. Choose File > Open Workspace and open the workspace ModeChoiceEstimation.wrk.\r\nStep 2. Choose Planning > Mode Split > Logit Model Estimation to open the Logit Model Estimation box.\r\nStep 3. Click the Load button and select the model file NestedLogitModelEstimation.mdl.\r\nStep 4. Click the Estimate tab and enter an output file name.\r\nStep 5. Click Save and select a file name to save the model.\r\nStep 6. Click Run. TransCAD estimates the Nested Logit Model, reports the results in a report form and displays and the Results Summary dialog box.\r\nStep 7. Click Close. TransCAD opens the Load Confirmation window. Click Yes.\r\nStep 8. Click the Utilities tab. The Coefficient column row contains the new estimated parameters.\r\nStep 9. Double-click on the nodes in the tree view window to see estimated values of the ASCs and Thetas.\r\nStep 10. Choose File > Close All to close all of the windows.\r\nTask 9: Applying a NL Model on a Matrix\r\nStep 1. Choose File > Open Workspace and open the workspace ModeChoiceAggregateApplication.wrk.\r\nStep 2. Choose Planning > Mode Split > Logit Model Application to open the Logit Model Application box.\r\nStep 3. Click the Load button and select the model file NestedLogitAggregateModel.mdl.\r\nStep 4. Click the Apply tab and select additional outputs by checking the “Output Logsum Values” and “Output Utility Values” boxes.\r\nStep 5. Check the “Open Outputs” box to ensure that the output files are opened after the model has been applied.\r\nStep 6. Click Run.\r\nStep 7. Click Yes in the Confirmation dialog box to save the changes, type “First Name-MC-NL” as the file name and click Save. The Mode Choice Model Application Outputs dialog box is displayed with file names for each of the desired outputs.\r\nStep 8. Check the “Overwrite all files” box and click OK. TransCAD applies the Nested Logit model, reports the results in a report form and displays the Results Summary dialog box.\r\nStep 9. Click Close. TransCAD opens the Utility, Logsum, Probability and Applied Totals matrices.\r\nStep 10. Choose File > Close All to close all of the windows.\r\nTraffic Assignment\r\nTraffic assignment models are used to estimate the traffic flows on a network. These models take as input a matrix of flows that indicate the volume of traffic between origin and destination (O-D) pairs. They also take input on the network topology, link characteristics, and link performance functions. The flows for each O-D pair are loaded onto the network based on the travel time or impedance of the alternative paths that could carry this traffic. TransCAD provides the widest array of traffic assignment procedures that can be used for modeling urban traffic. These procedures include numerous variants that can be used for modeling intercity passenger and freight traffic.\r\nTraffic assignment is a key element in the urban travel demand forecasting process. The traffic assignment model predicts the network flows that are associated with future planning scenarios and generates estimates of the link travel times and related attributes that are the basis for benefits estimation and air quality impacts. The traffic assignment model is also used to generate the estimates of network performance that are used in the mode choice and trip distribution or destination choice stages of many models.\r\nUser Equilibrium (UE)\r\nAssignment UE assignment is the recommended method for traffic assignment unless a more advanced model is employed. UE procedures use an iterative process to achieve a convergent solution, in which no travelers can improve their travel times by shifting routes. In each iteration, TransCAD computes network link flows that are based upon flow-dependent travel times. The formulation of the UE problem is a mathematical program and the Frank-Wolfe (FW) solution method is one of several employed in TransCAD. Another way to compute a UE assignment is to use an alternative algorithm such as path-based algorithm.\r\nSystem Optimum (SO)\r\nAssignment SO computes an assignment that minimizes total travel time on the network. Under SO assignment, no users can change routes without increasing the total travel time on the system, although it is possible that travelers could reduce their own travel times. SO assignment can be thought of as a model in which total system cost is minimized when travelers are told which routes to use. Obviously not a behaviorally realistic model, SO assignment can be useful in analyzing Intelligent Transportation System (ITS) scenarios.\r\nTask 10: Performing a User Equilibrium Traffic Assignment\r\nStep 1. Choose File > Open Workspace, then open the workspace TrafficAssign.wrk. TransCAD displays a street map and a flow matrix. You want to assign flow to the links using the User Equilibrium model.\r\nStep 2. Choose Planning > Static Traffic Assignment > Traffic Assignment to display the Traffic Assignment dialog box.\r\nStep 3. Choose N-Conjugate UE from the Method drop-down list, AM Peak Period Trips from the Matrix File drop-down list, Total (7-9) from the Matrix drop-down list, and type “10” in the Iterations edit box.\r\nStep 4. In the Field column of the grid view, verify that \\[Freeflow\r\nTime\\] is chosen for Time and \\[AB_AMCapacity/BA_AMCapacity\\] is chosen for Capacity drop-down list. The other settings are correct.\r\nStep 5. Click Options to display the Options dialog box. \\\r\nStep 6. Check the Create Theme box, type “3” in the Max V/C edit box and click OK.\r\nStep 7. Click OK to display the Output File Settings dialog box.\r\nStep 8. Type “First Name-TA-UE” as the Flow Table file name in the Short File Name cell and click OK. TransCAD assigns the flow to the links in the network and displays the Results Summary dialog box.\r\nStep 9. Click Close. TransCAD displays the results in a joined view and displays a color theme of the volume-to-capacity ratio and a scaled-symbol theme of flow on the map.\r\nStep 10. Choose File > Close All and click No to close the map, dataview, and matrix without saving changes.\r\nTask 11: Performing Assignment with Critical Link Analysis\r\nStep 1. Choose File > Open Workspace, then open the workspace TrafficAssignCriticalLink.wrk. TransCAD displays a map and a flow matrix. You want to assign flow to the links using the User Equilibrium model and report the O-D traffic over the Critical Links.\r\nStep 2. Choose Planning > Static Traffic Assignment > Traffic Assignment to display the Traffic Assignment dialog box.\r\nStep 3. Choose N-Conjugate UE from the Method drop-down list, AM Peak Period Trips from the Matrix File drop-down list, and Total (7-9) from the Matrix drop-down list.\r\nStep 4. In the Field column of the grid, verify that \\[Freeflow\r\nTime\\] is chosen for Time row and \\[AB_AMCapacity/BA_AMCapacity\\] is chosen in the Capacity row.\r\nStep 5. Type “10” in the Iterations edit box. The other settings are correct.\r\nStep 6. Click Options to display the Options dialog box and click the Other Options tab.\r\nStep 7. Check the Select Link/Zone Queries box to open the File Open dialog box. Choose the CriticalLink.qry query file and click Open. The queries appear in the scroll list.\r\nStep 8. Highlight the I-495 Westbound query and click OK to return to the Traffic Assignment dialog box.\r\nStep 9. Click OK to display the Output File Settings dialog box.\r\nStep 10. Highlight and change the Flow Table file name to “First Name-TA-CF.”\r\nStep 11. Highlight and change the Critical Matrix file name to “First Name-TA-CM.”\r\nStep 12. Click OK. TransCAD assigns the flow to the links in the network and displays the Results Summary dialog box.\r\nStep 13. Click Close. TransCAD displays the results in a joined view and displays the Critical Link Analysis matrix, indicating the O-D pairs and flows that utilize the critical link. The results are displayed in each direction of the link.\r\nStep 14. Choose Map > Thematic Mapping > Size to display the Scaled Symbol Theme dialog box.\r\nStep 15. Choose \\[AB_Flow_I-495 Westbound\\] near the button of the scroll list and click OK. TransCAD adds a scaled-symbol theme to the map showing flow patterns for everyone who travels over the critical links.\r\nStep 16. Choose File > Close All and click No to close all of the windows without saving.\r\nMulti-Modal Multi-Class Assignment (MMA)\r\nMMA is a flexible master assignment routine designed for use in major metropolitan areas and is directly applicable in statewide or interregional models. The MMA model is a generalized cost assignment that lets you assign trips by individual modes or user classes to the network simultaneously. This method allows you to explicitly model the influence of toll facilities of all types, as well as HOV and HOT facilities. Each mode or class can have different network exclusions, congestion impacts (passenger car equivalent values), values of time, and toll costs.\r\nTask 12: Performing Multi-Modal Assignment\r\nStep 1. Choose File > Open Workspace, then open the workspace TrafficAssignMultiModal.wrk. TransCAD displays a map of highways in Massachusetts, along with a flow matrix for cars, light trucks and heavy trucks, and a toll matrix describing tolls between entry and exit nodes on the Massachusetts Turnpike. A network is also loaded. You want to assign the multiple-mode flow matrix to the network using fixed tolls and the toll matrix.\r\nStep 2. Choose Highways from the drop-down list on the Standard toolbar.\r\nStep 3. Choose Planning > Static Traffic Assignment > Multi-Modal Multi-Class Assignment to display the Multi-Modal Multi-Class Assignment dialog box.\r\nStep 4. Verify that N Conjugate UE is chosen from the Method drop-down list, Bureau of Public Roads (BPR) is chosen from the Delay Function drop-down list and AM Trips (7:00-9:00) is chosen from the O-D Matrix drop-down list.\r\nStep 5. Click Tolls to display the Toll Settings dialog box, choose Mass Pike Toll Schedule from the Toll Matrix drop-down list and click OK to return to return to the Multi-Modal Multi-Class Assignment box.\r\nStep 6. Click on the Choose OD Classes button, highlight all available matrices and click on the Add >> button to select all matrices and click OK.\r\nStep 7. Make the following changes in the Cars – Class 1 row: - Click on the cell in the Link Toll column and choose \\[Car Toll\\] from the drop-down list - Click on the cell in the OD Toll column and choose Cars – Class 1 from the drop-down list\r\nStep 8. Make the following changes in the Truck – 4T row: - Click on the cell in the Link Toll column and choose \\[Truck 4T Toll\\] from the drop-down list - Click on the cell in the OD Toll column and choose Truck – 4T from the drop-down list\r\nStep 9. Make the following changes in the Trucks – SU row: - Click on the cell in the PCE Global column and type “2.0” - Click on the cell in the Link Toll column and choose \\[Truck SU Toll\\] from the drop-down list - Click on the cell in the OD Toll column and choose Trucks – SU from the drop-down list\r\nStep 10. Make the following changes in the Trucks – Combo row: - Click on the cell in the PCE Global column and type “3.0” - Click on the cell in the Link Toll column and choose \\[Truck Combo Toll\\] from the drop-down list - Click on the cell in the OD Toll column and choose Trucks – Combo from the drop-down list - Click on the cell in the Exclusion Set column and choose Truck Combo Exclusion from the drop-down list\r\nStep 11. In the Delay Function Parameters grid, verify that \\[AB_FFTime/BA_FFTime\\] is the field chosen for Time and \\[AB_AMCapacity/BA_AMCapacity\\] is the field chosen for Capacity. The other settings are correct.\r\nStep 12. Click OK to display the Output File Settings dialog box.\r\nStep 13. Type “First Name-TA-MMA” in the File Prefix edit box and click OK. TransCAD assigns the flows to the links in the network and displays the Results Summary dialog box.\r\nStep 14. Click Close. TransCAD displays the results in a joined view.\r\nStep 15. Choose Map > Thematic Mapping > Size to display the Scaled Symbol Theme dialog box.\r\nStep 16. Choose AB_Flow_Truck – Combo from the scroll list and click OK. TransCAD adds a scaled-symbol theme of the assigned flows on the map.\r\nStep 17. Choose File > Close All and click No to All to close all of the windows without saving.\r\nPart II: Network and Route Analysis\r\nVehicle Routing Many businesses and government agencies transport goods from one or more central locations to a set of destinations. It is important to manage these operations efficiently, both to reduce operating costs and to ensure that pickups and deliveries adhere to reasonable service standards. This general problem is known as the vehicle routing problem. Solving the vehicle routing problem involves determining how many vehicles are required to service the destinations and developing a route and schedule for each one. Because there are many variations of the problem, it can be very difficult to solve. TransCAD provides a rich set of vehicle routing tools that solve various types of routing problems.\r\nTask 13: Solving a Vehicle Routing Problem\r\nStep 1. Choose File > Open, then open the map VehicleRoutingwithTimeWindows.map. TransCAD displays a map with two depots and 25 stops.\r\nStep 2. Choose File > Open and open the network BOSTON.NET.\r\nStep 3. Choose Routing/Logistics > Vehicle Routing to display the Vehicle Routing Wizard.\r\nStep 4. Click the Create New Vehicle Routes radio button, verify that Delivery is chosen from the Operations Mode drop-down list and click Next to display the Customers page.\r\nStep 5. Notice that TransCAD already has chosen to use all features in the Clients layer and has found the fields for name, demand, service time, and time window. Click Next to display the Depots page.\r\nStep 6. Notice that TransCAD already has chosen to use all features in the Depots layer and has found the fields for name, open time, and close time. Click Next to display the Vehicles page.\r\nStep 7. Click “green plus sign” six times to add 6 vehicles.\r\nStep 8. Click and drag to highlight all of the cells in the Cost column and type 100 to set the costs for all six vehicles.\r\nStep 9. Click and drag to highlight all of the cells in the Capacity column and type 50 to set the capacities for all six vehicles.\r\nStep 10. For vehicles 4-6, choose Free Port Depot from the drop-down list in the Depot column.\r\nStep 11. Click Next to display the Options page.\r\nStep 12. Enter 8 in the Maximum Route Duration box, choose Time (in hours) from the Balance Routes by drop-down list, and click Finish. TransCAD displays the Save Vehicle Routing Results In dialog box.\r\nStep 13. Right-click in the dialog box, choose New > Folder, name the folder “First Name-VRP-Results,” and click Select Folder.\r\nStep 14. Click OK in the status dialog box. TransCAD adds the routes to the map and opens the Vehicle Routing Manager. Notice the five routes have approximately even durations.\r\nStep 15. Click “plus sign” next to a route to see the stops that route services.\r\nStep 16. Right-click the itinerary description at the top of the list and choose Create Report. TransCAD creates a PDF report. Scroll through the PDF to see the itinerary for each route. Close the report when you are done.\r\nNetwork Flow Models\r\nTransCAD includes a set of procedures for solving network flow problems. These problems involve efficient delivery of goods or services and arise both in transportation and in many other contexts. For example: - You need to ship an inventory of goods from 15 warehouses to 100 retail centers, each with a given demand, and you want to determine which warehouses should service which retail centers to minimize the total transportation cost. - You need to route empty rail cars from their current locations to locations where they are required for new loads, taking into account rail traffic density by link.\r\nTask 14: Solving a Transportation Problem and Displaying Output Flow\r\nStep 1. Choose File > Open Workspace, then open the workspace TransportationProblem.wrk. TransCAD displays a map of Washington State. On the map, there are three warehouses and 20 customers. You want to determine which warehouse ships tSo which customer. Also opened is a travel time matrix between each warehouse and each customer.\r\nStep 2. Choose Routing/Logistics > The Transportation Problem to display The Transportation Problem dialog box.\r\nStep 3. Choose WAREHOUSE from the Layer drop-down list under Origin Settings and choose CUSTOMER from the Layer drop-down list under Destination Settings. Step 4. Verify that Wa_hwy.net is the active network.\r\nStep 5. Choose TIME from the Cost Field drop-down list.\r\nStep 6. The other settings are correct. Click OK to display the Output File Settings dialog box.\r\nStep 7. Change the output file names as done above and click OK. TransCAD solves the Transportation Problem and assigns the shipments to links in the network. A joined view is opened showing the flow on each link.\r\nStep 8. Click on the map window or choose Window > U.S. Highways to make the map the active window. TransCAD shows a scaled-symbol theme showing the flow on each link.\r\nStep 9. Choose File > Close All and click No to close the map and matrix without saving any changes.\r\nFacility Location Models\r\nFacility Location Models are used to identify good locations for warehouses, hospitals, retail stores, manufacturing facilities, and other types of facilities. In general, the goal in locating such facilities is either to provide a high level of service, to minimize operating costs, or to maximize profits. TransCAD solves many different types of facility location problems, with applications in both the public and private sectors. Here are two examples: - You need to determine the best location for a new branch of a public library. Your goal is to provide the best overall level of access to city residents. - You need to determine the best location for a new police station. Your goal is to reduce the maximum distance a patrol car needs to travel from the station to a resident’s home.\r\nTask 15: Solving a Facility Location Problem\r\nStep 1. Choose File > Open Workspace, then open the workspace FacilityLocation.wrk. TransCAD displays a map of the Northeast Sales Region. On the map, there are 46 customers, one existing facility and 8 candidate facilities. A matrix file is also opened. You want to determine what two facilities to add to minimize shipping cost.\r\nStep 2. Choose Routing/Logistics > Facility Location to display the Facility Location dialog box.\r\nStep 3. Type “2” in the # New Facilities edit box. Step 4. Choose Facility from the Layer drop-down list under Facility Settings.\r\nStep 5. Choose Customer from the Layer drop-down list under Client Settings.\r\nStep 6. Choose Demand from the Weight drop-down list.\r\nStep 7. Click OK to display the Output File Settings dialog box.\r\nStep 8. Type “First Name-FL” in the Short File Name cell and click OK. TransCAD determines the two new facilities to open that, in conjunction with the existing facility in New York, will minimize the cost of shipping to the 46 customers. A selection set named New Facilities, containing these facilities, is displayed on the map. A table is joined to the Customer layer showing which facility will service each customer. The results summary is also displayed. Click Close to close the Results Summary dialog box.\r\nStep 9. Click on the map or choose Window > Map1 to make the map the active window and see the new facilities to open. Step 10. Choose File > Close All and click No to close the map, matrix and joined view without saving nay changes.\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-11-11T19:41:33-05:00",
    "input_file": "transportation-modeling-with-transcad.knit.md"
  },
  {
    "path": "posts/2021-10-22-turning-movement-count-tmc/",
    "title": "Turning Movement Count (TMC)",
    "description": {},
    "author": [
      {
        "name": "ECIV 340L, CEE, UofSC",
        "url": {}
      }
    ],
    "date": "2021-10-22",
    "categories": [],
    "contents": "\r\n\r\nContents\r\nIntroduction\r\nEquipment\r\nData Collection\r\nData Analysis\r\nConclusions\r\n\r\n\r\nbody {\r\ntext-align: justify}\r\n\r\n\r\n\r\nRELATED RESOUCES:\r\nLECTURE SLIDES\r\nDATA FORM\r\n`DEMO CALCULATION\r\n`DEMO CALCULATION-2\r\nIntroduction\r\nAny traffic Study requires accurate traffic counts. Determining how many vehicles use a section of roadway or an intersection is necessary for analyzing and timing signals, determining capacity, and estimating the level of service that will be needed. Accurate counts of current traffic flow provide a departure point for estimates of future traffic volume. Moreover, the effectiveness of various traffic control measures, geometric modifications, or maintenance practices is governed by traffic volume data. The turning movement count at controlled intersections (those containing signs or signals) is another way to determine traffic volume.\r\nEquipment\r\nThe equipment list for data collection procedure is a stopwatch (cell phone) and note-taking materials.\r\nData Collection\r\nVisit the site, and choose a location and time to collect the data For this lab session, the student groups will gather data to identify the peak-hour traffic volume and how it varies at the peak-hour period.\r\nAs described the student groups will be measuring departure volumes. Departure volume denotes vehicles which are not counted until they have entered the intersection and executed their turning movements. This method serves most traffic engineering needs except when observing a signal at which the demand volume exceeds the capacity. Typically, the tuning movement counts (TMC) should start at least one hour before the projected peak hour and continue for one hour after the projected peak hour.\r\nCollect and record the data Data is observed in fifteen minute increments throughout the count periods—usually three hours. Before starting, the times marking the beginning of each fifteen-minute observation period are recorded. Then the watch is started, and the volume count begins. During each time period, the approach that each vehicle used to enter the intersection is recorded as well as whether it turned left, right, or continued straight when exiting the intersection. The Turning Movement Count Data Collection Form has a column for each of the twelve possible movements that can occur at the intersection. At the end of each fifteen-minute period, the observer continues counting but now records the data on the next row, and so on, until the counting period is complete.\r\nCheck your work before leaving the field Before leaving the field, the data collection form should be checked to see that all field data have been collected correctly. Any unusual observations should be listed as comments.\r\nData Analysis\r\nCheck the data Even though the data is checked for completeness prior to leaving the field, it is wise to check each Field Data Sheet again prior to reduction and analysis.\r\nSummarize field sheets Class demo\r\nIdentify the peak hour, and compute the peak-hour factor The peak hour and the peak-hour factor are computed from the entries on the summary sheet. The peak hour is determined by identifying the four consecutive fifteen-minute (1-hour) periods having the highest volume. The peak-hour factor (PHF) is a valuable indicator of flow variability within the peak hour. It is computed by dividing the peak-hour volume by the Peak Rate of Flow. The Peak Rate of Flow is four times the peak fifteen-minute flow within the peak hour. PHF’s can range from a low of 0.25 to a high of 1.00. PHF of 0.25 indicates all of the peak hour traffic occurs during the one fifteen-minute interval whereas PHF of 1.00 indicates the peak hour traffic is spread out evenly throughout the hour.\r\nNote: Computation of the peak-hour factor is not limited to the intersection as a whole. It can be computed for each approach and for each lane or lane groups as well.\r\nClass demo\r\nPrepare a graphical summary While a tabular summary is useful, a graphical summary presents information that can be more readily comprehended. A check of the entries can be made by summing all of the values for vehicles entering the intersection and comparing it to the sum of the values for vehicle exiting the intersection.\r\nClass demo\r\nUse the HCS7 TWSC module to create report Class demo\r\nInterpret the data and draw conclusions Interpretation of volume data depends on the use for which the count was conducted. Among the questions to be addressed are: • Is the traffic evenly distributed among all the approaches to the intersection? • Does the peak-hour factor indicate that a surge of traffic is arriving at the intersection during particular time frame, or is the traffic spread out evenly over the peak hour? • Are there heavy turning volumes? • What percentage of the approach volume is heavy vehicles?\r\nConclusions\r\nThe last step is to draw conclusion based on the vehicle counts and the report produced from HCS7.\r\nNote: While some of these questions may lead to useful conclusions, volume data alone cannot answer all the questions that may arise about an intersection. Additional information such as accident history, signal timing, pedestrian flow, and volume distribution throughout the remainder of the day may be needed to complete the traffic engineering analysis.\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-10-22T21:32:49-04:00",
    "input_file": {}
  },
  {
    "path": "posts/2021-10-28-headway-study/",
    "title": "Headway Study",
    "description": {},
    "author": [
      {
        "name": "ECIV 340L, CEE, UofSC",
        "url": {}
      }
    ],
    "date": "2021-10-22",
    "categories": [],
    "contents": "\r\n\r\nContents\r\nINTRODUCTION\r\nData Collection\r\nData Analysis\r\n\r\n\r\nbody {\r\ntext-align: justify}\r\n\r\n\r\n\r\nRELATED RESOUCES:\r\nLECTURE SLIDES\r\nDATA FORM\r\n`DEMO CALCULATION\r\n`DEMO CALCULATION-2\r\nINTRODUCTION\r\nIn the analysis of unsignalized intersections, it is important to know the minimum size of the headway in traffic flow that drivers are willing to accept when entering or crossing a traffic stream. The length of a headway is measured from the front of one vehicle to the bumper of the next. Although many methods exist to compute the expected number of headways of a given size in the traffic stream, the traffic engineer usually must assume the minimum headway drivers actually will use. Based on this assumption, there are methods to identify the level of service at an intersection, as well as the capacity of each of its approaches. For instance, the 2010 Highway Capacity Manual’s analysis methodology assumes a minimum acceptable headway in the flow of conflicting traffic through an intersection without signals, then computes the level of service and capacity for each of the movements. Pedestrians preparing to cross the roadway must assess the headways in the conflicting traffic, determine when one of sufficient length exists, and decide if they will cross. Again, there is a methodology that allows the investigator to compute the number and size of the headway expected and identifies whether there are sufficient headways to allow safe pedestrian passage. However, all of the computation methods require identification of the minimum headway before calculations can be made.\r\nEquipment The equipment list for data collection procedure is a stopwatch (cell phone) and note-taking materials.\r\nData Collection\r\nVisit the site, and choose a location and time to collect the data For this lab session, the student groups will gather data to identify the minimum acceptable headway for left-turn and right-turn traffic from the minor roadway using simulation video. The major roadway should have relatively high volume.\r\nCollect and record the data A time headway is measured from the time the last conflicting vehicle passes the intersection until the next conflicting vehicle passes it. A useable headway is one that a minor-road vehicle uses to execute a maneuver. Use the attached form to record the useable headways (in seconds) in the conflicting traffic. For the right-turn maneuver, the conflicting traffic consists of only the vehicles traveling in the near lanes of the major highway—those lanes in which the right-turning vehicle will merge. For instance, if the minor traffic approaches the intersection northbound and wishes to travel eastbound (turn right) on the major roadway, then only the eastbound traffic conflicts with the movement. Likewise, should the vehicle wish to travel westbound (turn left) on the major road, then both eastbound and westbound traffic are conflicting. For each minor-approach vehicle, the headway that is used is measured and the time is recorded. Should a vehicle arrive at the intersection and not have to wait for a conflicting vehicle to pass before proceeding, then the time is measured from when the vehicle moves into the intersection until the next conflicting vehicle arrives. Should multiple vehicles use the headway, only the first vehicle is recorded as passing and the size of the headway is measured. At least 50 left turns and 50 right turns from the minor roadway should be observed.\r\nCheck your work before leaving the field Before leaving the field, the data collection form should be checked to see that all field data have been collected correctly. Any unusual observations should be listed as comments.\r\nData Analysis\r\nSummarize field data on the provided form To properly arrive at a minimum useable headway, the collected observations need to be summarized. The Headway Study Data Summary Form attached to this handout allows for the headways to be grouped in 0.25-seconds increments. For the first increment (3.0 entry in the “headway” column), the number of headways measuring 3.0 to 3.25, inclusive, is entered in the “# Observed” column. The frequency is computed by dividing the entry by the total number of observations. The cumulative frequency is computed by summing all frequencies up to, and including, the row being calculated. The calculation is similar to that performed in Session 1 (Spot Speed Study).\r\nIdentify minimum acceptable headway Identification of the minimum acceptable headway from the observations requires a criterion. In traffic engineering, a criterion is usually expressed in percent of drivers or vehicles for which a design standard applies. This recognizes that traffic engineers cannot design for every vehicle-driver combination. For this lab session, an 85% acceptance rate will be the criterion. Therefore, the student wishes to identify the smallest headway that 85% or more of the drivers observed would use. This value is identified by scanning down the “Cumulative Frequency” column until the first entry is found that is ≥0.15. The maximum headway size for that row is the minimum headway that 85% of the observed drivers need in order to execute that maneuver. For instance, if the 5.25-second row has a cumulative frequency of 0.16 for the left-turn move, then the minimum acceptable headways can be said to be 5.50 seconds—the upper limit of the group. That means 84% of the drivers will use a headway at least 5.50 seconds in length.\r\nCompare observed values to standardized values The student should compare the observed minimum headways to the standard values used in Highway Capacity Manual (HCM) analyses. The HCM uses the minimum headways shown in the following\r\nBase Critical Headway (HCM, 2010)\r\nVeh. Maneuver\r\n2-lane Major Road\r\n2-lane Major Road\r\nRight turn from minor street\r\n6.2 s\r\n6.9 s\r\nLeft turn from minor street\r\n7.1 s\r\n7.5 s\r\nEstimate the Probability of the minimum acceptable headway occurring in the traffic stream and the number of acceptable headways expected Once an acceptable headway has been identified, both the number and frequency of headways occurring in the traffic stream can be calculated. Based on the assumption that vehicle arrivals on the main roadway are random arrivals and follow a Poisson distribution, then the probability of a headway, h, in seconds being greater than, or equal to, a specified value, t, in seconds is:\r\n\\(Pr⁡(h≥t)=e^(-qt/3600)\\)\r\nwhere q= flow in vehicles per hour. Given a minimum acceptable headway of 5.50 seconds, the probability of headways greater than, or equal to, this minimum value on a roadway with 300 vehicles per hour is 0.632 or 63.2%. Additionally, the expected number of acceptable headways that may be expected can be calculated by multiplying the vehicle volume, minus one, by the probability. For the calculation completed:\r\n\\(Frequency=(q-1)× e^{-qt/3600} =(300-1)×0.632 = 189 \"headways\\ per\\ hour\\)\r\nThis indicates that sufficient headways in the traffic exist at this intersection for 189 vehicles per hour to be accommodated by the minor approach.\r\nSummarize and draw conclusions The following questions can help the student summarize and interpret the results of the data and computations. Did the headways in the traffic stream appear to be random? If not, why not? Were there sufficient headways to allow the proper flow of traffic from the minor roadway? Was the minimum acceptable headway larger, smaller, or as expected? Is a 90% criterion reasonable or should different values be used at different locations? Do the HCM values properly represent driver behavior in the region? What other conclusions can be made from this study?\r\nInput data for the report: Assume the flow of traffic, \\(q = 450\\ vehicles\\ per\\ hour.\\)\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-10-28T18:56:48-04:00",
    "input_file": {}
  },
  {
    "path": "posts/2021-10-28-profile-leveling/",
    "title": "Profile Leveling",
    "description": {},
    "author": [
      {
        "name": "ECIV 340L, CEE, UofSC",
        "url": {}
      }
    ],
    "date": "2021-10-22",
    "categories": [],
    "contents": "\r\n\r\nContents\r\nPROFILE LEVELING\r\nStaking and Stationing the Reference Line\r\nField Procedures for Profile Leveling\r\nDrawing and Using the Profile\r\n\r\n\r\n\r\nbody {\r\ntext-align: justify}\r\n\r\n\r\n\r\nThe following excerpt was copied verbatim from the book: Elementary Surverying: An Introduction to Geomatics (13th Ed.) by CHARLES D. GHILANI and PAUL R. WOLF \r\nPROFILE LEVELING\r\nBefore engineers can properly design linear facilities such as highways, railroads, transmission lines, aqueducts, canals, sewers, and water mains, they need accurate information about the topography along the proposed routes. Profile leveling, which yields elevations at definite points along a reference line, provides the needed data. The subsections that follow discuss topics pertinent to profile leveling and include staking and stationing the reference line, field procedures for profile leveling, and drawing and using the profile.\r\nStaking and Stationing the Reference Line\r\nDepending on the particular project, the reference line may be a single straight segment, as in the case of a short sewer line; a series of connected straight segments which change direction at angle points, as with transmission lines; or straight segments joined by curves, which occur with highways and railroads. The required alignment for any proposed facility will normally have been selected as the result of a preliminary design, which is usually based on a study of existing maps and aerial photos.The reference alignment will most often be the proposed construction centerline, although frequently offset reference lines are used.\r\nTo stake the proposed reference line, key points such as the starting and ending points and angle points will be set first. Then intermediate stakes will be placed on line, usually at 100-ft intervals if the English system of units is used, but sometimes at closer spacing. If the metric system is used, stakes are usually placed at 10-, 20-, 30-, or 40-m spacing, depending on conditions. Distances for staking can be taped, or measured using the electronic distance measuring (EDM) component of a total station instrument operating in its tracking mode (see Sections 8.2 and 23.9).\r\n\r\nIn route surveying, a system called stationing is used to specify the relative horizontal position of any point along the reference line.The starting point is usually designated with some arbitrary value, for example in the English system of units, or although can be used. If the beginning point was a stake 100 ft along the line from it would be designated the one 200 ft along the line etc. The term full station is applied to each of these points set at 100-ft increments.This is the usual increment staked in rural areas. A point located between two full stations, say 84.90 ft beyond station would be designated Thus, locations of intermediate points are specified by their nearest preceding full station and their so-called plus. For station the plus is 84.90. If the metric system is used, full stations are 1 km (1000 m) apart. The starting point of a reference line might be arbitrarily designated as or but again could be used. In rural areas, intermediate points are normally set at 30- or 40-m increments along the line, and are again designated by their pluses. If the beginning point was and stakes were being set at 40-m intervals, then etc. would be set.\r\nIn rugged terrain and in urban situations, stakes are normally set closer together, for example at half stations (50-ft increments) or even quarter stations (25-ft increments) in the English system of units. In the metric system, 20-, 10-, or even 5-m increments may be staked. Stationing not only provides a convenient unambiguous method for specifying positions of points along the reference line, it also gives the distances between points. For example, in the English system stations and are or 633.4 ft, apart, and in the metric system stations and are 920 m apart.\r\nField Procedures for Profile Leveling\r\nProfile leveling consists simply of differential leveling with the addition of intermediate minus sights (foresights) taken at required points along the reference line. Figure 5.11 illustrates an example of the field procedure, and the notes in Figure 5.12 relate to this example. Stationing for the example is in feet. As shown in the figure, the leveling instrument is initially set up at a convenient location and a plus sight of 10.15 ft taken on the benchmark. Adding this to the benchmark elevation yields a HI of 370.63 ft. Then intermediate minus sights are taken on points along the profile at stations as etc. (If the reference line’s beginning is far removed from the benchmark, differential levels running through several turning points may be necessary to get the instrument into position to begin taking intermediate minus sights on the profile line.) Notice that the note form for profile leveling contains all the same column headings as differential leveling, but is modified to include another column labeled “Intermediate Sight.”\r\n\r\nWhen distances to intermediate sights become too long, or if terrain variations or vegetations obstruct rod readings ahead, the leveling instrument must be moved. Establishing a turning point, as TP1 in Figure 5.11, does this.After reading a minus sight on the turning point, the instrument is moved ahead to a good vantage point both for reading the backsight on the turning point, as well as to take additional rod readings along the profile line ahead. The instrument is leveled, the plus sight taken on TP1, the new HI computed, and further intermediate sights taken. This procedure is repeated until the profile is completed. Whether the stationing is in feet or meters, intermediate sights are usually taken at all full stations. If stationing is in feet and the survey area is in rugged terrain or in an urban area, the specifications may require that readings also be taken at half- or even quarter-stations. If stationing is in meters, depending on conditions, intermediate sights may be taken at 40-, 30-, 20-, or 10-m increments. In any case, sights are also taken at high and low points along the alignment, as well as at changes in slope. Intermediate sights should always be taken on “critical” points such as railroad tracks, highway centerlines, gutters, and drainage ditches. As presented in Figure 5.12, rod readings are normally only taken to the nearest 0.1 ft (English system) or nearest cm (metric system) where the rod is held on the ground, but on critical points, and for all plus and minus sights taken on turning points and benchmarks, the readings are recorded to the nearest hundredth of a foot (English) or the nearest mm (metric). In profile leveling, lengths of intermediate minus sights vary, and in general they will not equal the plus sight length. Thus errors due to an inclined line of sight and to curvature and refraction will occur. Because errors from these sources increase with increasing sight lengths, on important work the instrument’s condition of adjustment should be checked (see Section 4.15), and excessively long intermediate foresight distances should be avoided. Instrument heights (HIs) and elevations of all turning points are computed immediately after each plus sight and minus sight. However, elevations for intermediate minus sights are not computed until after the circuit is closed on either the initial benchmark or another. Then the circuit misclosure is computed, and if acceptable, an adjustment is made and elevations of intermediate points are calculated. The procedure is described in the following subsection. As in differential leveling, the page check should be made for each left-hand sheet. However in profile leveling, intermediate minus sights play no part in this computation. As illustrated in Figure 5.12, the page check is made by adding the algebraic sum of the column of plus sights and the column of minus sights to the beginning elevation. This should equal the last elevation tabulated on the page for either a turning point or the ending benchmark if that is the case, as it is in the example of Figure 5.12.\r\nDrawing and Using the Profile\r\nPrior to drawing the profile, it is first necessary to compute elevations along the reference line from the field notes. However, this cannot be done until an adjustment has been made to distribute any misclosure in the level circuit. In the adjustment process, HIs are adjusted, because they will affect computed profile elevations. The adjustment is made progressively in proportion to the total number of HIs in the circuit.The procedure is illustrated in Figure 5.12, where the misclosure was 0.03 ft. Since there were three HIs, the correction applied to each is per HI. Thus a correction of 0.01 was applied to the first HI, ft to the second, and ft to the third. Adjusted HIs are shown in Figure 5.12 in parentheses above their unadjusted values. It is unnecessary to correct turning point elevations since they are of no consequence.After adjusting the HIs, profile elevations are computed by subtracting intermediate minus sights from their corresponding adjusted HIs. The profile is then drawn by plotting elevations on the ordinate versus their corresponding stations on the abscissa. By connecting adjacent plotted points, the profile is realized. Until recently, profiles were manually plotted, usually on special paper like the type shown in Figure 5.13. Now with computer-aided drafting and design (CADD) systems (see Section 18.14), it is only necessary to enter the stations and elevations into the computer, and this special software will plot and display the profile on the screen. Hard copies, if desired, may be obtained from plotters interfaced with a computer.\r\n\r\nOften these profiles are generated automatically from the CADD software using only the alignment of the structure and an overlaying topographic map. In drawing profiles, the vertical scale is generally exaggerated with respect to the horizontal scale to make differences in elevation more pronounced. A ratio of 10:1 is frequently used, but flatness or roughness of the terrain determines the desirable proportions.Thus, for a horizontal scale of the vertical scale might be The scale actually employed should be plainly marked. Plotted profiles are used for many purposes, such as (1) determining depth of cut or fill on proposed highways, railroads, and airports; (2) studying grade-crossing problems; and (3) investigating and selecting the most economical grade, location, and depth for sewers, pipelines, tunnels, irrigation ditches, and other projects. The rate of grade (or gradient or percent grade) is the rise or fall in feet per 100 ft, or in meters per 100 m. Thus a grade of 2.5% means a 2.5-ft difference in elevation per 100 ft horizontally. Ascending grades are plus; descending grades, minus. A gradeline of %, chosen to approximately equalize cuts and fills, is shown in Figure 5.13. Along this grade line, elevations drop at the rate of 0.15 ft per 100 ft. The grade begins at station where it approximately meets existing ground at elevation 363.0 ft, and ends at station and elevation 361.6 ft where again it approximately meets existing ground. The process of staking grades is described in Chapter 23. The term grade is also used to denote the elevation of the finished surface on an engineering project.\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-10-29T10:11:37-04:00",
    "input_file": {}
  },
  {
    "path": "posts/2021-10-28-queue-length-study/",
    "title": "Queue Length Study",
    "description": {},
    "author": [
      {
        "name": "ECIV 340L, CEE, UofSC",
        "url": {}
      }
    ],
    "date": "2021-10-22",
    "categories": [],
    "contents": "\r\n\r\nContents\r\nINTRODUCTION\r\nEQUIPMENT\r\nDATA COLLECTION\r\nDATA ANALYSIS\r\n\r\n\r\nbody {\r\ntext-align: justify}\r\n\r\n\r\n\r\nRELATED RESOUCES:\r\nLECTURE SLIDES\r\nDATA FORM\r\nINTRODUCTION\r\nThis session addresses a topic that applies to many situations both on and off roadway. Queue length determination and analysis identifies the characteristics of a waiting line of vehicles or people. It makes use of the Poisson distribution of arrivals along with a negative exponential distribution of service times. The procedure is useful in customer service analyses of drive-in banking and fast-food restaurants; it is also used in predicting toll-booth activity and parking garage utilization. Information such as the average length of waiting time, length of a queue, and length of a storage lane can be easily computed. The procedure is limited to single-channel or single-queue analysis, since it requires little data acquisition to produce meaningful results. Procedures exist for multi-channel analysis of two or more drive-in windows, toll booths, or similar service bays that require minimal data acquisition to render useful results.\r\nEQUIPMENT\r\nThe equipment list for data collection procedure is a stopwatch (cell phone) and note-taking materials.\r\nDATA COLLECTION\r\nChoose a location to study and a time to collect data\r\nThe student group should choose a fast-food facility or drive-in bank that has only one operating window. Fast-food restaurants that have two successive windows—one used to take order and the next to receive food—are acceptable. As an alternative, the student group may wish to choose a toll booth. If so, the toll booth should be a single booth with only one queue. It is important that the traffic entering and exiting the service line can be easily counted. This observation should take place during a peak period when the service rate (the number of vehicles serviced per hour) is at, or near, its highest. The service rate to be determined should be the maximum service rate the facility can render—when the arrival rate is at its highest and workers are the most motivated. For some facilities, this may be a significant factor in obtaining data needed to determine the service rate. For others, the service time may be unaffected by the arrival rate and length of queue. The student group should be aware of the possible effect on the data quality.\r\nCollect data and record values\r\nTwo sets of data will be obtained. One should address the service rate of the facility and the other the variation in the length of the queue. Service time is the time it takes one vehicle from the queue to be serviced by the facility and depart. For a bank, the service time starts when the vehicle stops at the speaker or window and ends when the vehicle starts to move. Using the data collection form attached to this handout, 50 service times will be collected. Collection of the queue length variations over the course of 60 minutes is obtained by recording the queue length at the end of each minute for one hour. Consecutive readings are required over this period, since the variability in length of the queue is to be compared to theoretical computed values. The student group starts timing and at the end of each minute observes and records the length of the queue, excluding any vehicle being serviced. Simultaneously, the number of vehicles arriving and entering the queue is recorded at the end of each 5-minute arrival.\r\nCheck your work before leaving the field\r\nBefore leaving the field, the data collection form should be checked to see that all field data have been collected correctly. Any unusual observations should be listed as comments.\r\nDATA ANALYSIS\r\nSummarize field data on form providedSince the values were computed in the field, the computations are rechecked. Next, the queue-length data is reduced, using the data summary form. The procedure begins with identifying the number of queues that had 0 vehicle, 1 vehicle, 2 vehicles, and so on, and entering these values in Column 2. The sum of Column 2 should be 60, the number of queues observed. Column 3 is the frequency of that queue length and is computed by dividing Column 2 by the total, 60. Column 4, cumulative frequency, is computed by adding all frequencies, including the time interval.\r\nCalculate standard relationshipsUsing the collected data, a number of standard relationships can be calculated. These can be used to identify and assess the performance characteristics of the facility. The formulae and an example calculation of each are shown below. These use an assumed service rate of 140 vehicles per hour and an assumed arrival rate of 90 vehicles per hour.\r\nFor each of the calculations, q equals the arrival rate in vehicles per hour, and Q equals the service rate in vehicles per hour.\r\nThe probability of exactly n units being in the system, where n equals the total number of vehicles—including the unit being served is:\\(Pr(n)=(\\frac{q}{Q})^n(1-\\frac{q}{Q})\\)\r\nTherefore, the probability of exactly 2 vehicles in the system is \\(0.148\\). The expected, or average number of vehicles in the system, \\(E(n)\\) is:\\(E(n)=\\frac{q}{(Q-q)}\\)\r\nTherefore, the average number of vehicles in the system for the example is \\(1.8\\).\r\nThe average queue length, E(m),is:\r\n\\(E(m)= \\frac{q^2}{Q(Q-q)}\\)\r\nThe mean queue length is 1.16 vehicles.\r\nThe average waiting time in the queue after arrival, E(w), is:\r\n\\(E(w)=\\frac{q}{Q(Q-q)}\\)\r\nThis calculates to be \\(0.013\\) hours or \\(46.3\\) seconds.\r\nThe average time a vehicle spends in the system including being served and waiting to be served, E(v), is:\r\n\\(E(v)=\\frac{1}{(Q-q)}\\)\r\nThis calculates to be \\(0.02\\) hours or \\(72\\) seconds.\r\nThe probability of a vehicle spending time, t hours, or less in the system is:\r\n\\(Pr(v \\le t)= 1- e^{-(1-\\frac{q}{Q})qt}\\)\r\nIf it is desirable to know how often the total time a vehicle will be in the system less than \\(50\\) seconds, then the equation yields \\(0.36\\).\r\nThe probability of a vehicle spending time, t, or less in the queue is:\r\n\\(Pr(w \\le t) = 1-\\frac{q}{Q}e^{-(1-\\frac{q}{Q})qt}\\)\r\nLikewise, if it is desirable to know how often the waiting time will be less than or equal to \\(50\\) seconds, then the equation yields \\(0.589\\).\r\nThe probability of more than N vehicles in the queue is:\r\n\\(Pr(n \\gt N)= (\\frac{q}{Q})^{N+1}\\)\r\nThis equation can be used to find the length of the storage lane for the queue. If it is desirable to have the storage lane long enough to accommodate 90% of the queues that develop, then Pr⁡(n>N)=0.10 and the equation can be solved for N. For the example rates, it is computed that more than 4 vehicles will be in the queue 10.9% of the time, and more than 5 vehicles will be in the queue 7% of the time. Based on this, a storage lane long enough to accommodate 5 vehicles should be sufficient over 90% of the time.\r\nClass demo\r\nSummarize and interpret results\r\nHaving computed all of the relationships, the student group can now examine the results and draw conclusions about the expected operation of the facility. Among additional questions that may be addressed are:\r\nDoes the observed average queue length compare favorably to the computed value? If not, is there an indication why? If it is desirable for the facility to have sufficient storage length for 95% of the expected queues to be accommodated, how many vehicles must be accommodated? Do the computed values indicate the need for improvements in the operation of the facility, such as the addition of more windows or channels, or changes in the operation to increase the rate of service? Assuming an arrival rate equal to 90% of the service rate, how much of an increase in service time can occur at the facility before the queue length gets too long for the site?\r\nThese and other questions can provide useful input to the decision maker responsible for the operation of a business facility. Given the small amount of data collection needed to render significant results, the study of queue length is a cost-effective management tool. The procedure presented here for single-channel analysis is similar to that for multi-channel applications.\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-10-29T10:28:43-04:00",
    "input_file": {}
  },
  {
    "path": "posts/2021-10-14-spot-speed-study/",
    "title": "Spot Speed Study",
    "description": {},
    "author": [
      {
        "name": "ECIV 340L, CEE, UofSC",
        "url": {}
      }
    ],
    "date": "2021-10-15",
    "categories": [],
    "contents": "\r\n\r\nContents\r\nIntroduction\r\nEquipment\r\nData Collection\r\nData Analysis\r\nConclusions\r\n\r\n\r\nbody {\r\ntext-align: justify}\r\n\r\n\r\n\r\nRELATED RESOUCES:\r\nLECTURE SLIDES\r\nDATA FORM\r\n`DEMO CALCULATION\r\nIntroduction\r\nObserving vehicle speeds is one way traffic engineers measure travel safety on roadways. High speeds carry a high risk, whereas low speeds are relatively safe. In addition, observed speeds are used in capacity analysis, crash analysis, geometric studies, determining the need for pedestrian crossings, and in before-and-after studies to assess the effectiveness of roadway modifications. Also, speed observations are compared to the posted speed limit to help determine whether the roadway is in need of greater law enforcement, realignment, or reconstruction. With so many important decisions being based on observed speeds, it is imperative that such speed data be collected correctly and presented effectively.\r\nEquipment\r\nThe equipment list for data collection procedure is: a stopwatch (cell phone), measuring tape/wheel, and note taking materials.\r\nData Collection\r\nVisit the site, and choose a location and time to take observations\r\nFor this lab, the student groups will gather data during the off-peak period during daylight hours on a Friday.\r\nMark the speed trap\r\nThe student groups will measure and mark a section of the road long enough to start a stopwatch when a vehicle enters the trap and stop it when the vehicle exists the trap. The recorded time is later used to compute vehicle speed. The trap’s length should be governed by the anticipated speeds of the observed traffic. Minimum suggested lengths are shown below:\r\nRecommended Trap Length\r\nIf Speed \\(< 25 mph\\) then min. length : \\(88 feet\\)\r\nIf Speed \\(25 - 40 mph\\) then min. length : \\(176 feet\\)\r\nIf Speed \\(> 40 mph\\) then min. length : \\(264 feet\\)\r\nPavements marking should be easily visible to those timing the vehicles. Markings should be placed outside the traveled way, preferably on sidewalks or curbs. Physical features such as utility poles, tress, and signposts can be used as the trap markers.\r\nCollect the data, and record it on the Spot Speed Study form\r\nThe student groups must use the attached Spot Speed Study Data Collection Form to record speed data. All of the information at the top of the form must be completed before data collection can proceed. When a vehicle enters the speed trap, and the watch is started; when the vehicle exists the trap the watch is stopped, and the time is recorded. The student groups should then repeat the process until at least 100 observations are obtained.\r\nCheck your work before leaving the field\r\nBefore leaving the field, the data collection form should be checked to see that all field data have been collected correctly. The student groups should compute one or two speeds from the observed times to see if they are reasonable.\r\nData Analysis\r\nCompute speeds\r\nA column is provided on the data collection sheet to compute the speed of the vehicles observed. The speed can be computed using the formula:\r\n\\(V = d / 1.47t\\)\r\nwhere \\(V\\) is the speed in miles per hour, \\(d\\) is the length of the trap in feet, and \\(t\\) is the recorded time in seconds.\r\nConstruct speed groups\r\nClass demo\r\nPlot histogram\r\nClass demo\r\nCompute frequency and cumulative frequency\r\nClass demo\r\nPlot cumulative frequency curve\r\nClass demo\r\nDetermine\r\nthe mean speed,\r\nthe standard deviation of speed,\r\nthe median speed (50th percentile speed),\r\nthe pace,\r\nthe mode or modal speed,\r\nthe 85th percentile speed\r\nClass demo\r\nPace: the range of speed—usually taken at 10 mph intervals—that has the greatest number of observations.\r\nInterpret the speed curve\r\nConclusions\r\nThe last step is to draw conclusion based on the observed speed data.\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-10-14T17:30:14-04:00",
    "input_file": {}
  },
  {
    "path": "posts/2021-09-30-surface-area-and-volume/",
    "title": "Surface Area and Earthwork",
    "description": "The purposed of this lab is to learn how to identify station in the highway horizontal curve using Total Station (TS).",
    "author": [
      {
        "name": "ECIV 340L, CEE, UofSC",
        "url": {}
      }
    ],
    "date": "2021-10-01",
    "categories": [],
    "contents": "\r\n\r\nContents\r\nSurface Area\r\nEarthwork (Volume)\r\nSample Task\r\n\r\n\r\nbody {\r\ntext-align: justify}\r\n\r\n\r\n\r\nRELATED RESOUCES:\r\nLECTURE SLIDES\r\nLEVEL BOOK\r\nFIELD BOOK\r\nDATA FORM\r\nLAB PROCEDURE (FIELD)\r\n`DEMO CALCULATION\r\nSurface Area\r\nThere are a number of important reasons for determining areas. One is to include the acreage of a parcel of land in the deed describing the property. Other purposes are to determine the acreage of fields, lakes, etc., or the number of square yards to be surfaced, paved, seeded, or sodded. Another important application is determining end areas for earthwork volume calculations. In plane surveying, area is considered to be the orthogonal projection of the surface onto a horizontal plane. In the English system, the most commonly used units for specifying small areas are the ft2 and yd2, and for large tracts the acre is most often used, where 1 acre = 43,560 ft2. In the metric system, smaller areas are usually given in m2, and for larger tracts hectares are commonly used, where 1 hectare is equivalent to a square having sides of 100 m, and thus equals 10,000 m2. In converting areas between the English and metric systems, the conversion factors given below are useful.\r\n\r\nBoth field and map measurements are used to determine area. Field measurement methods are the more accurate and include:\r\ndivision of the tract into simple figures (triangles, rectangles, and trapezoids),\r\noffsets from a straight line,\r\ncoordinates, and\r\ndouble-meridian distances.\r\nMethods of determining area from map measurements include:\r\ncounting coordinate squares,\r\ndividing the area into triangles, rectangles, or other regular geometric shapes,\r\ndigitizing coordinates, and\r\nrunning a planimeter over the enclosing lines.\r\n\r\n\r\n\r\n\r\nEarthwork (Volume)\r\nPersons engaged in surveying (geomatics) are often called on to determine volumes of various types of material. Quantities of earthwork and concrete are needed, for example, on many types of construction projects. Volume computations are also required to determine the capacities of bins, tanks, reservoirs, and buildings, and to check stockpiles of coal, gravel, and other materials. The most common unit of volume is a cube having edges of unit length. Cubic feet, cubic yards, and cubic meters are used in surveying calculations, with cubic yards and cubic meters being most common for earthwork. Note 1 yd3 = 27 ft3; 1 m3 = 35.3144 ft3. Direct measurement of volumes is rarely made in surveying, since it is difficult to actually apply a unit of measure to the material involved. Instead, indirect measurements are obtained by measuring lines and areas that have a relationship to the volume desired. Three principal systems are used:\r\nthe cross-section method,\r\nthe unit-area (or borrow-pit) method, and\r\nthe contour-area method.\r\n\r\n\r\n\r\n\r\nSample Task\r\n\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-09-30T17:04:35-04:00",
    "input_file": {}
  },
  {
    "path": "posts/2021-09-23-highway-alignment-field/",
    "title": "Highway Alignment (Field)",
    "description": "The purposed of this lab is to learn how to identify station in the highway horizontal curve using Total Station (TS).",
    "author": [
      {
        "name": "ECIV 340L, CEE, UofSC",
        "url": {}
      }
    ],
    "date": "2021-09-24",
    "categories": [],
    "contents": "\r\n\r\nContents\r\nHORIZONTAL ALIGNMENT\r\nDegree of Circular Curve\r\nCircular Curve Equations\r\nCircular Curve Stationing\r\nCircular Curve Layout Methods\r\nComputing Deflection Angles and Chords\r\nTask 1: Circular Curve Layout with a Total Station\r\nSteps\r\nField Book Sample:\r\n\r\n\r\nVERTICAL ALIGNMENT\r\nVertical Curve Equations\r\nTask 2: Crest Vertical Curve Layout with a Total Station\r\n\r\n\r\n\r\nbody {\r\ntext-align: justify}\r\n\r\n\r\n\r\nRELATED RESOUCES:\r\nLECTURE SLIDES\r\nLEVEL BOOK\r\nFIELD BOOK\r\nDATA FORM\r\nLAB PROCEDURE (FIELD)\r\nDEMO CALCULATION\r\nHORIZONTAL ALIGNMENT\r\nCurves used in horizontal planes to connect two straight tangent sections are called horizontal curves. Two types are used: circular arcs and spirals. Both are readily laid out in the field with surveying equipment. A simple curve (Fig. 1a) is a circular arc connecting two tangents. It is the type most often used. A compound curve (Fig. 1b) is composed of two or more circular arcs of different radii tangent to each other, with their centers on the same side of the alignment. The combination of a short length of tangent (less than 100 ft) connecting two circular arcs that have centers on the same side (Fig. 1c) is called a broken-back curve. A reverse curve (Fig. 1d) consists of two circular arcs tangent to each other, with their centers on opposite sides of the alignment. Compound, broken-back, and reverse curves are unsuitable for modern high-speed highway, rapid transit, and railroad traffic and should be avoided, if possible. However, they are sometimes necessary in mountainous terrain to avoid excessive grades or very deep cuts and fills. Compound curves are often used on exit and entrance ramps of interstate highways and expressways, although easement curves are generally a better choice for these situations. Easement curves are desirable, especially for railroads and rapid transit systems, to lessen the sudden change in curvature at the junction of a tangent and a circular curve. A spiral makes an excellent easement curve because its radius decreases uniformly from infinity at the tangent to that of the curve it meets. Spirals are used to connect a tangent with a circular curve, a tangent with a tangent (double spiral), and a circular curve with a circular curve. Figure 2 illustrates these arrangements.\r\n\r\nThe effect of centrifugal force on a vehicle passing around a curve can be balanced by superelevation, which raises the outer rail of a track or outer edge of a highway pavement. Correct transition into superelevation on a spiral increases uniformly with the distance from the beginning of the spiral and is in inverse proportion to the radius at any point. Properly superelevated spirals ensure smooth and safe riding with less wear on equipment. As noted, spirals are used for railroads and rapid-transit systems. This is because trains are constrained to follow the tracks, and thus a smooth, safe, and comfortable ride can only be assured with properly constructed alignments that include easement curves. On highways, spirals are less frequently used because drivers are able to overcome abrupt directional changes at circular curves by steering a spiraled path as they enter and exit the curves.\r\nDegree of Circular Curve\r\nThe rate of curvature of circular curves can be designated either by their radius (e.g., a 1000-ft curve) or by their degree of curve. There are two different designations for degree of curve, the arc definition and the chord definition. By the arc definition, degree of curve is the central angle subtended by a circular arc of 100 ft (see Fig. 3a). This definition is preferred for highway work. By the chord definition, degree of curve is the angle at the center of a circular arc subtended by a chord of 100 ft (see Fig. 3b). This definition is convenient for very gentle curves and hence is preferred for railroads.\r\n\r\nCircular Curve Equations\r\n\r\nCircular Curve Stationing\r\nNormally, an initial route survey consists of establishing the PIs according to plan, laying out the tangents, and establishing continuous stationing along them from the start of the project, through each PI, to the end of the job. After the tangents have been staked and stationed, the intersection angle (I) is observed at each PI and curves computed and staked. The station locations of points on any curve are based upon the stationing of the curve’s PI. To compute the PC station, tangent distance T is subtracted from the PI station, and to calculate the PT station, curve length L is added to the PC station.\r\nCircular Curve Layout Methods\r\nExcept for unusual cases, the radii of curves on route surveys are too large to permit swinging an arc from the curve center. Circular curves are therefore laid out by more practical methods, including (1) deflection angles, (2) coordinates, (3) tangent offsets, (4) chord offsets, (5) middle ordinates, and (6) ordinates from the long chord.\r\nComputing Deflection Angles and Chords\r\nTo stake the first station, which is normally an odd distance from the PC (shorter than a full-station increment), subdeflection angle δ_a and subchord c_a are needed.\r\n\r\nTask 1: Circular Curve Layout with a Total Station\r\nAssume that I=4°12’, the station of the PI is 64 + 27.46, and terrain conditions require the minimum radius permitted by the specifications to be 2864.79 ft (arc definition). Layout the circular curve using a total station and total chord method.\r\n\r\nSteps\r\nRegardless of the method used to stake intermediate curve points, the first steps in curve layout are:\r\n(1) establishing the PC and PT, normally by measuring tangent distance T from the PI along both the back and forward tangents and\r\n(2) measuring the total deflection angle at the PC from PI to PT.\r\nWith the instrument set up and leveled over the PC, it is oriented by backsighting on the PI, or on a point along the back tangent, with 0°00’ on the circle. The subdeflection angle of 0°46’33\" is then turned. Meanwhile, the 22-ft mark of the tape is held on the PC. The zero end of the (add) tape is swung. This is station 63 + 00. Follow the same procedure to stake other stations.\r\nField Book Sample:\r\n\r\nVERTICAL ALIGNMENT\r\nThe vertical alignment contributes significantly to a highway’s safety, aesthetics, operations and costs. Long, gentle vertical curves provide greater sight distances and a more pleasing appearance for the driver. The design of vertical alignment involves, to a large extent, complying with specific limiting criteria. These criteria include maximum and minimum grades, sight distance at vertical curves and vertical clearances. In addition, the designer should adhere to certain general design principles and controls that will determine the overall safety and operation of the facility and will enhance the aesthetic appearance of the highway. Curves are needed to provide smooth transitions between straight segments (tangents) of grade lines for highways and railroads. Because these curves exist in vertical planes, they are called vertical curves. An example is illustrated in Figure 1, which shows the profile view of a proposed section of highway to be constructed from A to B. A grade line consisting of three tangent sections has been designed to fit the ground profile. Two vertical curves are needed: curve a to join tangents 1 and 2, and curve b to connect tangents 2 and 3. The function of each curve is to provide a gradual change in grade from the initial (back) tangent to the grade of the second (forward) tangent. Because parabolas provide a constant rate of change of grade, they are ideal and almost always applied for vertical alignments used by vehicular traffic. Two basic types of vertical curves exist, crest and sag. These are illustrated in Figure 1. Curve a is a crest type, which by definition undergoes a negative change in grade; that is, the curve turns downward. Curve b is a sag type, in which the change in grade is positive and the curve turns upward. There are several factors that must be taken into account when designing a grade line of tangents and curves on any highway or railroad project. They include (1) providing a good fit with the existing ground profile, thereby minimizing the depths of cuts and fills, (2) balancing the volume of cut material against fill, (3) maintaining adequate drainage, (4) not exceeding maximum specified grades, and (5) meeting fixed elevations such as intersections with other roads. In addition, the curves must be designed to (a) fit the grade lines they connect, (b) have lengths sufficient to meet specifications covering a maximum rate of change of grade (which affects the comfort of vehicle occupants), and (c) provide sufficient sight distance for safe vehicle operation.\r\n\r\nVertical Curve Equations\r\n\r\nTask 2: Crest Vertical Curve Layout with a Total Station\r\nA grade g_1 of +5.00% intersects grade g_2 of -4.40% at a vertex whose station and elevation are 45 + 00 and 855.50 ft, respectively. An equal-tangent parabolic curve 200 ft long has been selected to join two tangents. Layout the crest vertical curve using a total station.\r\n\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-09-23T17:06:36-04:00",
    "input_file": {}
  },
  {
    "path": "posts/2021-09-16-traverse-survey/",
    "title": "Traverse Survey",
    "description": "The purposed of this lab is to how to use data collected using Total Station (distance and angles) for closed-traverse calculation.",
    "author": [
      {
        "name": "ECIV 340L, CEE, UofSC",
        "url": {}
      }
    ],
    "date": "2021-09-17",
    "categories": [],
    "contents": "\r\n\r\nContents\r\nTRAVERSING\r\nDepartures and Latitudes\r\nTraverse Adjustment\r\nTraversing with a Total Station (Example)\r\nLab Task: Traversing\r\n\r\n\r\n\r\nbody {\r\ntext-align: justify}\r\n\r\n\r\n\r\nRELATED RESOUCES:\r\nLECTURE SLIDES\r\nLEVEL BOOK\r\nFIELD BOOK\r\nDATA FORM\r\nLAB PROCEDURE (FIELD)\r\nDEMO CALCULATION\r\nTRAVERSING\r\nA traverse is a series of consecutive lines whose ends have been marked in the field and whose lengths and directions have been determined from observations. In traditional surveying by ground methods, traversing, the act of marking the lines, that is, establishing traverse stations and making the necessary observations, is one of the most basic and widely practiced means of determining the relative locations of points. There are two kinds of traverses: closed and open. Two categories of closed traverses exist: polygon and link. In the polygon traverse, as shown in Fig. 1(a), the lines return to the starting point, thus forming a closed figure that is both geometrically and mathematically closed. Link traverses finish upon another station that should have a positional accuracy equal to or greater than that of the starting point. The link type (geometrically open, mathematically closed), as illustrated in Fig. 1(b), must have a closing reference direction. Closed traverses provide checks on the observed angles and distances, which is an extremely important consideration. They are used extensively in control, construction, property, and topographic surveys.\r\n\r\nAn open traverse (geometrically and mathematically open) (Fig. 2) consists of a series of lines that are connected but do not return to the starting point or close upon a point of equal or greater order accuracy. Open traverses should be avoided because they offer no means of checking for observational errors and mistakes.\r\n\r\nAzimuths: Azimuths are horizontal angles observed clockwise from any reference meridian. Azimuths have also been more generally defined as a horizontal angle measured clockwise from any fixed reference plane or easily established base direction line.\r\nBearings: Bearings are another system for designating directions of lines. The bearing of a line is defined as the acute horizontal angle between a reference meridian and the line. The angle is observed from either the north or south toward the east or west, to give a reading smaller than 90°. The letter N or S preceding the angle, and E or W following it shows the proper quadrant. Thus, a properly expressed bearing includes quadrant letters and an angular value. An example is N80°E.\r\n\r\nObservations of Traverse Angles: The methods used in observing angles or directions of traverse lines vary and include:\r\n(1) interior angles,\r\n(2) angles to the right,\r\n(3) deflection angles, and\r\n(4) azimuths.\r\nTraversing by Interior Angles: Interior-angle traverses are used for many types of work, but they are especially convenient for property surveys. Although interior angles could be observed either clockwise or counterclockwise, to reduce mistakes in reading, recording, and computing, they should always be turned clockwise from the Backsight station to the Foresight station. The procedure is illustrated in Fig. 1(a). Angle EAB of Fig. 1(a) was observed at station A, with the Backsight on station E and the foresight at station B.\r\nAngle Misclosure: The angular misclosure for an interior-angle traverse is the difference between the sum of the observed angles and the geometrically correct total for the polygon. The sum (Σ) of the interior angles of a closed polygon should be\r\n\r\nwhere n is the number of sides, or angles, in the polygon. The sum of the angles in a triangle is 180°; in a rectangle, 360°; and in a pentagon, 540°.\r\nSelection of Traverse Stations: Positions selected for setting traverse stations vary with the type of survey. In general, guidelines to consider in choosing them include accuracy, utility, and efficiency. Of course, intervisibility between adjacent stations, forward and back, must be maintained for angle and distance observations. The stations should also ideally be set in convenient locations that allow for easy access. Ordinarily, stations are placed to create lines that are as long as possible. This not only increases efficiency by reducing the number of instrument setups, but it also increases accuracy in angle observations.\r\n\r\nDepartures and Latitudes\r\nThe departure of a course is its orthographic projection on the east-west axis of the survey and is equal to the length of the course multiplied by the sine of its azimuth angle. Departures are sometimes called eastings or westings.\r\nThe latitude of a course is its orthographic projection on the north-south axis of the survey, and is equal to the course length multiplied by the cosine of its azimuth angle. Latitude is also called northing or southing.\r\n\r\nTraverse Adjustment\r\nFor any closed traverse, the linear misclosure must be adjusted (or distributed) throughout the traverse to “close” or “balance” the figure. This is true even though the misclosure is negligible in plotting the traverse at map scale. There are several elementary methods available for traverse adjustment, but the one most commonly used is the compass rule (Bowditch method).\r\nCompass (Bowditch) Rule The compass, or Bowditch, rule adjusts the departures and latitudes of traverse courses in proportion to their lengths. Corrections by this method are made according to the following rules:\r\nTraversing with a Total Station (Example)\r\nFor the traverse ABCDE, the observed interior angles are given in the table below. The fixed azimuth of line AW is 234°17’18\" and the measured angle to the right for EAW is 208°7’36\". It is known that the coordinate of point A is 10,000 Easting and 5,000 Northing. Calculate the coordinates of point B, C, D, and E. Additionally, determine the linear misclosure and precision.\r\n\r\n\r\n\r\nError of Closure:* If the measured bearings and distances are plotted on a sheet of paper, the figure will not close because of error in latitudes (E_L) and error in departures (E_D).\r\n\r\n\r\nLab Task: Traversing\r\nThe purpose of this task is to set a traverse with five stations (A, B, C, D, and E) as presented in previous section using interior angles to determine the angles between traverse lines. Additionally, compute the coordinates of the points of the traverse.Known Information:\r\n1. The fixed azimuth of line AW is 234°17’18\".\r\n2. The coordinate of point A is X = 5,000 Easting and Y = 7,500 Northing.\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-09-16T17:48:54-04:00",
    "input_file": {}
  },
  {
    "path": "posts/2021-09-10-total-station-and-traverse-survey/",
    "title": "Total Station and Traverse Survey",
    "description": "The purposed of this lab is to familiarize students with the TOTAL STATION (TS).  The students will learn how to measure distances and angles using TS.",
    "author": [
      {
        "name": "ECIV 340L, CEE, UofSC",
        "url": {}
      }
    ],
    "date": "2021-09-10",
    "categories": [],
    "contents": "\r\n\r\nContents\r\nTotal Station Introduction\r\nSetting up the Total Station\r\nCentering\r\nLeveling\r\nSurvey Prism Offset:\r\nAzimuth:\r\nNotations:\r\n\r\nField Work\r\nTask 1: Distance and Angle Measurement\r\nTask 2: Field Book Entry of Distance and Angle Measurement\r\n\r\n\r\n\r\n\r\nbody {\r\ntext-align: justify}\r\n\r\n\r\n\r\nRELATED RESOUCES:\r\nLECTURE SLIDES\r\nLEVEL BOOK\r\nFIELD BOOK\r\nDATA FORM\r\nLAB PROCEDURE (FIELD)\r\nDEMO CALCULATION\r\nTotal Station Introduction\r\nIn the past, transits and theodolites were the most commonly used surveying instruments for making angle observations. These two devices were fundamentally equivalent and could accomplish basically the same tasks. Today, the total station instrument has replaced transits and theodolites. Total station instruments can accomplish all of the tasks that could be done with transits and theodolites and do them much more efficiently. In addition, they can also observe distances accurately and quickly. Furthermore, they can make computations with the angle and distance observations and display the results in real time. These and many other significant advantages have made total stations the predominant instruments used in surveying practice today. They are used for all types of surveys including topographic, hydrographic, and construction surveys.\r\n\r\nSetting up the Total Station\r\nCentering\r\nStep 1. Make sure the legs are spaced at equal intervals and the head is approximately level. Set the tripod so that the head is positioned over the survey point. Make sure the tripod shoes are firmly fixed.\r\n\r\nStep 2. Place the instrument on the tripod head. Supporting it with one hand, tighten the centering screw on the bottom of the unit to make sure it is secured to the tripod.\r\n\r\nStep 3. Looking through the optical plummet eyepiece, turn the optical plummet eyepiece to focus on the reticle. Turn the optical plummet focusing ring to focus on the survey point.\r\n\r\nStep 4. Adjust the leveling foot screws to center the survey point in the optical plummet reticle.\r\n\r\nLeveling\r\nStep 1. Center the bubble in the circular level by either shortening the tripod leg closest to the off-center direction of the bubble or by lengthening the tripod leg farthest from the off-center direction of the bubble. Adjust one more tripod leg to center the bubble. Turn the leveling foot screws while checking the circular level until the bubble is centered in the center circle.\r\n\r\nStep 2. Power on the total station.\r\n\r\nStep 3. Center “” in the circular level.\r\n\r\nStep 4. Turn the instrument until the telescope is parallel to a line between leveling foot screws A and B, then tighten the horizontal clamp.\r\n\r\nStep 5. Set the tilt angle to 0° using foot screws A and B for the X direction and leveling screw C for the Y direction.\r\nStep 6. Loosen the centering screw slightly. Looking through the optical plummet eyepiece, slide the instrument over the tripod head until the survey point is exactly centered in the reticle. Retighten the centering screw securely.\r\nStep 7. Confirm that the bubble is positioned at the center of the circular level on the screen. If not, repeat the procedure starting from step 5.\r\nStep 8. When leveling is completed, press [OK] changes to the OBS mode.\r\nSurvey Prism Offset:\r\n−30mm (0.0984 ft)\r\nAzimuth:\r\nAzimuth is defined as a horizontal angle measured clockwise from a north base line. Azimuth has also been more generally defined as a horizontal angle measured clockwise from any fixed reference plane or easily established base direction line.\r\nIn the figure below, the azimuth of line AB is known to be 137° 17’ 00\" from the north. The azimuth of any other line that starts at A, such as AC in the figure, can be found directly using a total station instrument.\r\n\r\nNotations:\r\nTask 1: Distance and Angle Measurement The purpose of Task 1 is to determine the distances of point A, B, and C from Station Z. Additionally, the angles between ZA and ZB, ZB and ZC, and ZC and ZA need to be determined.\r\n\r\nField Work\r\nTask 1: Distance and Angle Measurement\r\n\r\nTask 2: Field Book Entry of Distance and Angle Measurement\r\n\r\n\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-09-10T10:54:48-04:00",
    "input_file": {}
  },
  {
    "path": "posts/2021-09-02-contouring/",
    "title": "Contouring",
    "description": "The purposed of this lab is to learn how to collect elevation data for a region (i.e., parcel of land) and use it to develope contour maps using (1) hand-sketch, (2) ArcGIS software, and (3) TransCAD software",
    "author": [
      {
        "name": "ECIV 340L, CEE, UofSC",
        "url": {}
      }
    ],
    "date": "2021-09-02",
    "categories": [],
    "contents": "\r\n\r\nContents\r\nContouring\r\nContouring in Field\r\nSetup\r\nData Collection\r\n\r\nContouring using ArcGIS\r\nContouring using TransCAD\r\n\r\n\r\nbody {\r\ntext-align: justify}\r\n\r\n\r\n\r\nRELATED RESOUCES:\r\nLECTURE SLIDES\r\nLEVEL BOOK\r\nFIELD BOOK\r\nDATA FORM\r\nLAB PROCEDURE (FIELD)\r\nDEMO CALCULATION\r\nContouring\r\nContouring needs the determination of elevation of various points on the ground and at the same time the horizontal positions of those points should be fixed. If the total station is used both horizontal and vertical controls can be achieved from the same instrument.\r\nContouring in Field\r\nQ: Draw contour of 98 ft and 99 ft?\r\nSetup\r\n\r\nData Collection\r\nX\r\nY\r\nElevation (Z) ft\r\nX\r\nY\r\nElevation (Z) ft\r\nX\r\nY\r\nElevation (Z)\r\nX\r\nY\r\nElevation (Z)\r\nA\r\n1\r\n99.50\r\nB\r\n1\r\n97.60\r\nC\r\n1\r\n96.25\r\nD\r\n1\r\n94.75\r\nA\r\n2\r\n97.60\r\nB\r\n2\r\n99.25\r\nC\r\n2\r\n98.60\r\nD\r\n2\r\n99.65\r\nA\r\n3\r\n98.75\r\nB\r\n3\r\n99.20\r\nC\r\n3\r\n97.75\r\nD\r\n3\r\n99.75\r\nA\r\n4\r\n100.75\r\nB\r\n4\r\n99.60\r\nC\r\n4\r\n99.90\r\nD\r\n4\r\n98.20\r\nContouring using ArcGIS\r\nStep 1:\r\nOpen ArcMap and activate “3D Analyst” and “Spatial Analyst” extensions. Click on customize > extensions and check two boxes like the following.\r\n\r\nStep 2:\r\nUse the data file named “elevdemo.dbf” (download from Blackboard). Then click on “Catalog” icon and go to the file location.\r\n\r\nStep 3:\r\nRight click on the file and choose Create Feature Class > From XY Table.\r\n\r\nStep 4:\r\nSpecify the location for the output “XYelevdemo.shp” file. Then click OK.\r\n\r\nStep 5:\r\nSelect the data “XYelevdemo.shp” file and click on “Add”. Ignore any warning.\r\n\r\nStep 6:\r\nOpen ArcToolbox; click on Geoprocessing > ArcToolBox. Then go to Create TIN (triangulated irregular network) option. Follow the steps below.\r\n\r\nStep 7:\r\nClick on “Create TIN” and follow the steps below and click OK.\r\n\r\nStep 8:\r\nThe TIN should look like the following. Export the TIN as a pdf file.\r\n\r\nStep 9:Click on 3D Analyst Tools > Triangulated Surface > Surface Contour.\r\n\r\nStep 10:\r\nFollow the steps below and click OK. This step is using 5 feet contour interval, you can choose any distance.\r\n\r\nStep 11:\r\nThe generated contour should look like the following. Export it as a pdf file.\r\n\r\nContouring using TransCAD\r\nStep 1:\r\nChoose File > Open, then open the “elevdemo.dbf.” Save the file as “elevdemo.dbd.”\r\nStep 2:\r\nChoose Tools > 3D > Terrian Analysis Toolbar to display the Terrain Analysis dialog box.\r\nStep 3:\r\nChoose All Features from the Based On drop-down list, USGS_NED_O from the Field drop-down list, and Feet from the Display Units drop-down list.\r\nStep 4:\r\nClick OK. TransCAD displays the Terrain Analysis Toolbar.\r\nStep 5:\r\nClick on the first option in the Terrain Analysis Toolbar to activate the Calculate Spot Data tool, and click anywhere on the map. The estimated elevation for the point where you click is shown in the toolbox.\r\nStep 6:\r\nClick on the second option in the Terrain Analysis Toolbar to activate the Show Profile tool, and click on two locations on the map. TransCAD adds a line annotation to the map and creates a new figure window showing the profile along the line as an area chart.\r\n\r\nStep 7:\r\nClick on “Generate Contours” in the Terrain Analysis Toolbar to display the Contour layer dialogue box. Follow the steps shown below.\r\n\r\nStep 8:\r\nSave the Contour Layer File. Show the contour labels. Then print the contour as a pdf file.\r\n\r\n \r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-09-03T11:19:32-04:00",
    "input_file": {}
  },
  {
    "path": "posts/2021-08-19-distance-measurement-and-leveling/",
    "title": "Distance and Elevation Measurements",
    "description": "The purposed of this lab is to learn how to take linear and elevation measurements and record data in the field and level book.",
    "author": [
      {
        "name": "ECIV 340L, CEE, UofSC",
        "url": {}
      }
    ],
    "date": "2021-08-27",
    "categories": [],
    "contents": "\r\n\r\nContents\r\nDistance and Elevation Measurement\r\nMethods\r\nLinear Measurements\r\nTaping\r\nPacing\r\n\r\nElevation Measurements\r\nLeveling\r\nDifferential Leveling\r\n\r\n\r\n\r\n\r\nbody {\r\ntext-align: justify}\r\n\r\n\r\n\r\nRELATED RESOUCES:\r\nLECTURE SLIDES\r\nDEMO CALCULATION\r\nLEVEL BOOK\r\nFIELD BOOK\r\nDATA FORM\r\nLAB PROCEDURE (FIELD)\r\nDistance and Elevation Measurement\r\nDistance measurement is generally regarded as the most fundamental of all surveying observations. In traditional ground surveys, even though many angles may be read, the length of at least one line must be measured to supplement the angles in locating points. In plane surveying, the distance between two points means the horizontal distance.\r\nIf the points are at different elevations, the distance is the horizontal length between vertical lines at the points. Lengths of lines may be specified in different units. In the United States, the foot, decimally divided, is usually used although the meter is becoming increasingly more common. Geodetic surveys, and many highway surveys employ the meter. In architectural and machine work, and on some construction projects, the unit is a foot divided into inches and fractions of an inch.\r\nMethods\r\nLinear Measurements\r\nIn surveying, linear measurements have been obtained by many different methods. These include:\r\npacing,\r\nodometer readings,\r\noptical rangefinders,\r\ntacheometry (stadia),\r\nsubtense bars,\r\ntaping,\r\nelectronic distance measurement (EDM),\r\nsatellite systems, and others.\r\nOf these, surveyors most commonly use taping, EDM, and satellite systems today. In particular, the satellite-supported Global Navigation Satellite Systems (GNSS) are rapidly replacing all other systems due to many advantages, but most notably because of their range, accuracy, and efficiency.\r\nTaping\r\n\r\nPacing\r\nDistances obtained by pacing are sufficiently accurate for many purposes in surveying, engineering, geology, agriculture, forestry, and military field sketching. Pacing is also used to detect blunders that may occur in making distance observations by more accurate methods.\r\nPacing consists of counting the number of steps, or paces, in a required distance. The length of an individual’s pace must be determined first. This is best done by walking with natural steps back and forth over a level course at least 300 ft long and dividing the known distance by the average number of steps. For short distances, the length of each pace is needed, but the number of steps taken per 100 ft is desirable for checking long lines.\r\nPacing is one of the most valuable things learned in surveying, since it has practical applications for everybody and requires no equipment. If the terrain is open and reasonably level, experienced pacers can measure distances of 100 ft or longer with an accuracy of 1/50 to 1/100 of the distance.\r\nElevation Measurements\r\nLeveling\r\nLeveling is the general term applied to any of the various processes by which elevations of points or differences in elevation are determined. It is a vital operation in producing necessary data for mapping, engineering design, and construction. Leveling results are used to (1) design highways, railroads, canals, sewers, water supply systems, and other facilities having grade lines that best conform to existing topography; (2) lay out construction projects according to planned elevations; (3) calculate volumes of earthwork and other materials; (4) investigate drainage characteristics of an area; (5) develop maps showing general ground configurations; and (6) study earth subsidence and crustal motion.\r\nDefinitions\r\n\r\nLeveling: The process of finding elevations of points or their differences in elevation.Benchmark (BM): A relatively permanent object, natural or artificial, having a marked point whose elevation above or below a reference datum is known or assumed.Backsight (BS): A sight taken to the level rod held at a point of known elevation (either a BM or TP).Height of instrument (HI): The elevation of the line of sight of the telescope.Foresight (FS): A sight taken on any point to determine its elevation.\r\nDifferential Leveling\r\nDifferential leveling is the process of measuring vertical distances from a known elevation point to determine elevations of unknown points.\r\n\r\nThe elevation of point A is 100 feet. Using this information determine the elevation of point B.\r\nSteps 1:\r\n\r\nStep 2:\r\n\r\nStep 3:\r\n\r\nStep 4:\r\n\r\nStep 5:\r\n\r\nStep 6:\r\n\r\nStep 7:\r\n\r\nThe elevation of point B = 105.92 feet.\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-08-26T16:49:32-04:00",
    "input_file": {}
  },
  {
    "path": "posts/2021-08-20-first-class/",
    "title": "ECIV 340L Introduction: Fall 2021",
    "description": "First Class of Fall 2021",
    "author": [
      {
        "name": "ECIV 340L, CEE, UofSC",
        "url": {}
      }
    ],
    "date": "2021-08-20",
    "categories": [],
    "contents": "\r\n\r\nbody {\r\ntext-align: justify}\r\nRELATED RESOUCES:\r\nLECTURE SLIDES\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-08-20T11:36:41-04:00",
    "input_file": {}
  }
]
