[
  {
    "path": "posts/2021-09-16-traverse-survey/",
    "title": "Traverse Survey",
    "description": "The purposed of this lab is to how to use data collected using Total Station (distance and angles) for closed-traverse calculation.",
    "author": [
      {
        "name": "ECIV 340L, CEE, UofSC",
        "url": {}
      }
    ],
    "date": "2021-09-17",
    "categories": [],
    "contents": "\r\n\r\nContents\r\nTRAVERSING\r\nDepartures and Latitudes\r\nTraverse Adjustment\r\nTraversing with a Total Station (Example)\r\nLab Task: Traversing\r\n\r\n\r\n\r\nbody {\r\ntext-align: justify}\r\n\r\n\r\n\r\nRELATED RESOUCES:\r\nLECTURE SLIDES\r\nLEVEL BOOK\r\nFIELD BOOK\r\nDATA FORM\r\nLAB PROCEDURE (FIELD)\r\nDEMO CALCULATION\r\nTRAVERSING\r\nA traverse is a series of consecutive lines whose ends have been marked in the field and whose lengths and directions have been determined from observations. In traditional surveying by ground methods, traversing, the act of marking the lines, that is, establishing traverse stations and making the necessary observations, is one of the most basic and widely practiced means of determining the relative locations of points. There are two kinds of traverses: closed and open. Two categories of closed traverses exist: polygon and link. In the polygon traverse, as shown in Fig. 1(a), the lines return to the starting point, thus forming a closed figure that is both geometrically and mathematically closed. Link traverses finish upon another station that should have a positional accuracy equal to or greater than that of the starting point. The link type (geometrically open, mathematically closed), as illustrated in Fig. 1(b), must have a closing reference direction. Closed traverses provide checks on the observed angles and distances, which is an extremely important consideration. They are used extensively in control, construction, property, and topographic surveys.\r\n\r\nAn open traverse (geometrically and mathematically open) (Fig. 2) consists of a series of lines that are connected but do not return to the starting point or close upon a point of equal or greater order accuracy. Open traverses should be avoided because they offer no means of checking for observational errors and mistakes.\r\n\r\nAzimuths: Azimuths are horizontal angles observed clockwise from any reference meridian. Azimuths have also been more generally defined as a horizontal angle measured clockwise from any fixed reference plane or easily established base direction line.\r\nBearings: Bearings are another system for designating directions of lines. The bearing of a line is defined as the acute horizontal angle between a reference meridian and the line. The angle is observed from either the north or south toward the east or west, to give a reading smaller than 90°. The letter N or S preceding the angle, and E or W following it shows the proper quadrant. Thus, a properly expressed bearing includes quadrant letters and an angular value. An example is N80°E.\r\n\r\nObservations of Traverse Angles: The methods used in observing angles or directions of traverse lines vary and include:\r\n(1) interior angles,\r\n(2) angles to the right,\r\n(3) deflection angles, and\r\n(4) azimuths.\r\nTraversing by Interior Angles: Interior-angle traverses are used for many types of work, but they are especially convenient for property surveys. Although interior angles could be observed either clockwise or counterclockwise, to reduce mistakes in reading, recording, and computing, they should always be turned clockwise from the Backsight station to the Foresight station. The procedure is illustrated in Fig. 1(a). Angle EAB of Fig. 1(a) was observed at station A, with the Backsight on station E and the foresight at station B.\r\nAngle Misclosure: The angular misclosure for an interior-angle traverse is the difference between the sum of the observed angles and the geometrically correct total for the polygon. The sum (Σ) of the interior angles of a closed polygon should be\r\n\r\nwhere n is the number of sides, or angles, in the polygon. The sum of the angles in a triangle is 180°; in a rectangle, 360°; and in a pentagon, 540°.\r\nSelection of Traverse Stations: Positions selected for setting traverse stations vary with the type of survey. In general, guidelines to consider in choosing them include accuracy, utility, and efficiency. Of course, intervisibility between adjacent stations, forward and back, must be maintained for angle and distance observations. The stations should also ideally be set in convenient locations that allow for easy access. Ordinarily, stations are placed to create lines that are as long as possible. This not only increases efficiency by reducing the number of instrument setups, but it also increases accuracy in angle observations.\r\n\r\nDepartures and Latitudes\r\nThe departure of a course is its orthographic projection on the east-west axis of the survey and is equal to the length of the course multiplied by the sine of its azimuth angle. Departures are sometimes called eastings or westings.\r\nThe latitude of a course is its orthographic projection on the north-south axis of the survey, and is equal to the course length multiplied by the cosine of its azimuth angle. Latitude is also called northing or southing.\r\n\r\nTraverse Adjustment\r\nFor any closed traverse, the linear misclosure must be adjusted (or distributed) throughout the traverse to “close” or “balance” the figure. This is true even though the misclosure is negligible in plotting the traverse at map scale. There are several elementary methods available for traverse adjustment, but the one most commonly used is the compass rule (Bowditch method).\r\nCompass (Bowditch) Rule The compass, or Bowditch, rule adjusts the departures and latitudes of traverse courses in proportion to their lengths. Corrections by this method are made according to the following rules:\r\nTraversing with a Total Station (Example)\r\nFor the traverse ABCDE, the observed interior angles are given in the table below. The fixed azimuth of line AW is 234°17’18\" and the measured angle to the right for EAW is 208°7’36\". It is known that the coordinate of point A is 10,000 Easting and 5,000 Northing. Calculate the coordinates of point B, C, D, and E. Additionally, determine the linear misclosure and precision.\r\n\r\n\r\n\r\nError of Closure:* If the measured bearings and distances are plotted on a sheet of paper, the figure will not close because of error in latitudes (E_L) and error in departures (E_D).\r\n\r\n\r\nLab Task: Traversing\r\nThe purpose of this task is to set a traverse with five stations (A, B, C, D, and E) as presented in previous section using interior angles to determine the angles between traverse lines. Additionally, compute the coordinates of the points of the traverse.Known Information:\r\n1. The fixed azimuth of line AW is 234°17’18\".\r\n2. The coordinate of point A is X = 5,000 Easting and Y = 7,500 Northing.\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-09-16T17:48:54-04:00",
    "input_file": {}
  },
  {
    "path": "posts/2021-09-10-total-station-and-traverse-survey/",
    "title": "Total Station and Traverse Survey",
    "description": "The purposed of this lab is to familiarize students with the TOTAL STATION (TS).  The students will learn how to measure distances and angles using TS.",
    "author": [
      {
        "name": "ECIV 340L, CEE, UofSC",
        "url": {}
      }
    ],
    "date": "2021-09-10",
    "categories": [],
    "contents": "\r\n\r\nContents\r\nTotal Station Introduction\r\nSetting up the Total Station\r\nCentering\r\nLeveling\r\nSurvey Prism Offset:\r\nAzimuth:\r\nNotations:\r\n\r\nField Work\r\nTask 1: Distance and Angle Measurement\r\nTask 2: Field Book Entry of Distance and Angle Measurement\r\n\r\n\r\n\r\n\r\nbody {\r\ntext-align: justify}\r\n\r\n\r\n\r\nRELATED RESOUCES:\r\nLECTURE SLIDES\r\nLEVEL BOOK\r\nFIELD BOOK\r\nDATA FORM\r\nLAB PROCEDURE (FIELD)\r\nDEMO CALCULATION\r\nTotal Station Introduction\r\nIn the past, transits and theodolites were the most commonly used surveying instruments for making angle observations. These two devices were fundamentally equivalent and could accomplish basically the same tasks. Today, the total station instrument has replaced transits and theodolites. Total station instruments can accomplish all of the tasks that could be done with transits and theodolites and do them much more efficiently. In addition, they can also observe distances accurately and quickly. Furthermore, they can make computations with the angle and distance observations and display the results in real time. These and many other significant advantages have made total stations the predominant instruments used in surveying practice today. They are used for all types of surveys including topographic, hydrographic, and construction surveys.\r\n\r\nSetting up the Total Station\r\nCentering\r\nStep 1. Make sure the legs are spaced at equal intervals and the head is approximately level. Set the tripod so that the head is positioned over the survey point. Make sure the tripod shoes are firmly fixed.\r\n\r\nStep 2. Place the instrument on the tripod head. Supporting it with one hand, tighten the centering screw on the bottom of the unit to make sure it is secured to the tripod.\r\n\r\nStep 3. Looking through the optical plummet eyepiece, turn the optical plummet eyepiece to focus on the reticle. Turn the optical plummet focusing ring to focus on the survey point.\r\n\r\nStep 4. Adjust the leveling foot screws to center the survey point in the optical plummet reticle.\r\n\r\nLeveling\r\nStep 1. Center the bubble in the circular level by either shortening the tripod leg closest to the off-center direction of the bubble or by lengthening the tripod leg farthest from the off-center direction of the bubble. Adjust one more tripod leg to center the bubble. Turn the leveling foot screws while checking the circular level until the bubble is centered in the center circle.\r\n\r\nStep 2. Power on the total station.\r\n\r\nStep 3. Center “” in the circular level.\r\n\r\nStep 4. Turn the instrument until the telescope is parallel to a line between leveling foot screws A and B, then tighten the horizontal clamp.\r\n\r\nStep 5. Set the tilt angle to 0° using foot screws A and B for the X direction and leveling screw C for the Y direction.\r\nStep 6. Loosen the centering screw slightly. Looking through the optical plummet eyepiece, slide the instrument over the tripod head until the survey point is exactly centered in the reticle. Retighten the centering screw securely.\r\nStep 7. Confirm that the bubble is positioned at the center of the circular level on the screen. If not, repeat the procedure starting from step 5.\r\nStep 8. When leveling is completed, press [OK] changes to the OBS mode.\r\nSurvey Prism Offset:\r\n−30mm (0.0984 ft)\r\nAzimuth:\r\nAzimuth is defined as a horizontal angle measured clockwise from a north base line. Azimuth has also been more generally defined as a horizontal angle measured clockwise from any fixed reference plane or easily established base direction line.\r\nIn the figure below, the azimuth of line AB is known to be 137° 17’ 00\" from the north. The azimuth of any other line that starts at A, such as AC in the figure, can be found directly using a total station instrument.\r\n\r\nNotations:\r\nTask 1: Distance and Angle Measurement The purpose of Task 1 is to determine the distances of point A, B, and C from Station Z. Additionally, the angles between ZA and ZB, ZB and ZC, and ZC and ZA need to be determined.\r\n\r\nField Work\r\nTask 1: Distance and Angle Measurement\r\n\r\nTask 2: Field Book Entry of Distance and Angle Measurement\r\n\r\n\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-09-10T10:54:48-04:00",
    "input_file": {}
  },
  {
    "path": "posts/2021-09-02-contouring/",
    "title": "Contouring",
    "description": "The purposed of this lab is to learn how to collect elevation data for a region (i.e., parcel of land) and use it to develope contour maps using (1) hand-sketch, (2) ArcGIS software, and (3) TransCAD software",
    "author": [
      {
        "name": "ECIV 340L, CEE, UofSC",
        "url": {}
      }
    ],
    "date": "2021-09-02",
    "categories": [],
    "contents": "\r\n\r\nContents\r\nContouring\r\nContouring in Field\r\nSetup\r\nData Collection\r\n\r\nContouring using ArcGIS\r\nContouring using TransCAD\r\n\r\n\r\nbody {\r\ntext-align: justify}\r\n\r\n\r\n\r\nRELATED RESOUCES:\r\nLECTURE SLIDES\r\nLEVEL BOOK\r\nFIELD BOOK\r\nDATA FORM\r\nLAB PROCEDURE (FIELD)\r\nDEMO CALCULATION\r\nContouring\r\nContouring needs the determination of elevation of various points on the ground and at the same time the horizontal positions of those points should be fixed. If the total station is used both horizontal and vertical controls can be achieved from the same instrument.\r\nContouring in Field\r\nQ: Draw contour of 98 ft and 99 ft?\r\nSetup\r\n\r\nData Collection\r\nX\r\nY\r\nElevation (Z) ft\r\nX\r\nY\r\nElevation (Z) ft\r\nX\r\nY\r\nElevation (Z)\r\nX\r\nY\r\nElevation (Z)\r\nA\r\n1\r\n99.50\r\nB\r\n1\r\n97.60\r\nC\r\n1\r\n96.25\r\nD\r\n1\r\n94.75\r\nA\r\n2\r\n97.60\r\nB\r\n2\r\n99.25\r\nC\r\n2\r\n98.60\r\nD\r\n2\r\n99.65\r\nA\r\n3\r\n98.75\r\nB\r\n3\r\n99.20\r\nC\r\n3\r\n97.75\r\nD\r\n3\r\n99.75\r\nA\r\n4\r\n100.75\r\nB\r\n4\r\n99.60\r\nC\r\n4\r\n99.90\r\nD\r\n4\r\n98.20\r\nContouring using ArcGIS\r\nStep 1:\r\nOpen ArcMap and activate “3D Analyst” and “Spatial Analyst” extensions. Click on customize > extensions and check two boxes like the following.\r\n\r\nStep 2:\r\nUse the data file named “elevdemo.dbf” (download from Blackboard). Then click on “Catalog” icon and go to the file location.\r\n\r\nStep 3:\r\nRight click on the file and choose Create Feature Class > From XY Table.\r\n\r\nStep 4:\r\nSpecify the location for the output “XYelevdemo.shp” file. Then click OK.\r\n\r\nStep 5:\r\nSelect the data “XYelevdemo.shp” file and click on “Add”. Ignore any warning.\r\n\r\nStep 6:\r\nOpen ArcToolbox; click on Geoprocessing > ArcToolBox. Then go to Create TIN (triangulated irregular network) option. Follow the steps below.\r\n\r\nStep 7:\r\nClick on “Create TIN” and follow the steps below and click OK.\r\n\r\nStep 8:\r\nThe TIN should look like the following. Export the TIN as a pdf file.\r\n\r\nStep 9:Click on 3D Analyst Tools > Triangulated Surface > Surface Contour.\r\n\r\nStep 10:\r\nFollow the steps below and click OK. This step is using 5 feet contour interval, you can choose any distance.\r\n\r\nStep 11:\r\nThe generated contour should look like the following. Export it as a pdf file.\r\n\r\nContouring using TransCAD\r\nStep 1:\r\nChoose File > Open, then open the “elevdemo.dbf.” Save the file as “elevdemo.dbd.”\r\nStep 2:\r\nChoose Tools > 3D > Terrian Analysis Toolbar to display the Terrain Analysis dialog box.\r\nStep 3:\r\nChoose All Features from the Based On drop-down list, USGS_NED_O from the Field drop-down list, and Feet from the Display Units drop-down list.\r\nStep 4:\r\nClick OK. TransCAD displays the Terrain Analysis Toolbar.\r\nStep 5:\r\nClick on the first option in the Terrain Analysis Toolbar to activate the Calculate Spot Data tool, and click anywhere on the map. The estimated elevation for the point where you click is shown in the toolbox.\r\nStep 6:\r\nClick on the second option in the Terrain Analysis Toolbar to activate the Show Profile tool, and click on two locations on the map. TransCAD adds a line annotation to the map and creates a new figure window showing the profile along the line as an area chart.\r\n\r\nStep 7:\r\nClick on “Generate Contours” in the Terrain Analysis Toolbar to display the Contour layer dialogue box. Follow the steps shown below.\r\n\r\nStep 8:\r\nSave the Contour Layer File. Show the contour labels. Then print the contour as a pdf file.\r\n\r\n \r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-09-03T11:19:32-04:00",
    "input_file": {}
  },
  {
    "path": "posts/2021-08-19-distance-measurement-and-leveling/",
    "title": "Distance and Elevation Measurements",
    "description": "The purposed of this lab is to learn how to take linear and elevation measurements and record data in the field and level book.",
    "author": [
      {
        "name": "ECIV 340L, CEE, UofSC",
        "url": {}
      }
    ],
    "date": "2021-08-27",
    "categories": [],
    "contents": "\r\n\r\nContents\r\nDistance and Elevation Measurement\r\nMethods\r\nLinear Measurements\r\nTaping\r\nPacing\r\n\r\nElevation Measurements\r\nLeveling\r\nDifferential Leveling\r\n\r\n\r\n\r\n\r\nbody {\r\ntext-align: justify}\r\n\r\n\r\n\r\nRELATED RESOUCES:\r\nLECTURE SLIDES\r\nDEMO CALCULATION\r\nLEVEL BOOK\r\nFIELD BOOK\r\nDATA FORM\r\nLAB PROCEDURE (FIELD)\r\nDistance and Elevation Measurement\r\nDistance measurement is generally regarded as the most fundamental of all surveying observations. In traditional ground surveys, even though many angles may be read, the length of at least one line must be measured to supplement the angles in locating points. In plane surveying, the distance between two points means the horizontal distance.\r\nIf the points are at different elevations, the distance is the horizontal length between vertical lines at the points. Lengths of lines may be specified in different units. In the United States, the foot, decimally divided, is usually used although the meter is becoming increasingly more common. Geodetic surveys, and many highway surveys employ the meter. In architectural and machine work, and on some construction projects, the unit is a foot divided into inches and fractions of an inch.\r\nMethods\r\nLinear Measurements\r\nIn surveying, linear measurements have been obtained by many different methods. These include:\r\npacing,\r\nodometer readings,\r\noptical rangefinders,\r\ntacheometry (stadia),\r\nsubtense bars,\r\ntaping,\r\nelectronic distance measurement (EDM),\r\nsatellite systems, and others.\r\nOf these, surveyors most commonly use taping, EDM, and satellite systems today. In particular, the satellite-supported Global Navigation Satellite Systems (GNSS) are rapidly replacing all other systems due to many advantages, but most notably because of their range, accuracy, and efficiency.\r\nTaping\r\n\r\nPacing\r\nDistances obtained by pacing are sufficiently accurate for many purposes in surveying, engineering, geology, agriculture, forestry, and military field sketching. Pacing is also used to detect blunders that may occur in making distance observations by more accurate methods.\r\nPacing consists of counting the number of steps, or paces, in a required distance. The length of an individual’s pace must be determined first. This is best done by walking with natural steps back and forth over a level course at least 300 ft long and dividing the known distance by the average number of steps. For short distances, the length of each pace is needed, but the number of steps taken per 100 ft is desirable for checking long lines.\r\nPacing is one of the most valuable things learned in surveying, since it has practical applications for everybody and requires no equipment. If the terrain is open and reasonably level, experienced pacers can measure distances of 100 ft or longer with an accuracy of 1/50 to 1/100 of the distance.\r\nElevation Measurements\r\nLeveling\r\nLeveling is the general term applied to any of the various processes by which elevations of points or differences in elevation are determined. It is a vital operation in producing necessary data for mapping, engineering design, and construction. Leveling results are used to (1) design highways, railroads, canals, sewers, water supply systems, and other facilities having grade lines that best conform to existing topography; (2) lay out construction projects according to planned elevations; (3) calculate volumes of earthwork and other materials; (4) investigate drainage characteristics of an area; (5) develop maps showing general ground configurations; and (6) study earth subsidence and crustal motion.\r\nDefinitions\r\n\r\nLeveling: The process of finding elevations of points or their differences in elevation.Benchmark (BM): A relatively permanent object, natural or artificial, having a marked point whose elevation above or below a reference datum is known or assumed.Backsight (BS): A sight taken to the level rod held at a point of known elevation (either a BM or TP).Height of instrument (HI): The elevation of the line of sight of the telescope.Foresight (FS): A sight taken on any point to determine its elevation.\r\nDifferential Leveling\r\nDifferential leveling is the process of measuring vertical distances from a known elevation point to determine elevations of unknown points.\r\n\r\nThe elevation of point A is 100 feet. Using this information determine the elevation of point B.\r\nSteps 1:\r\n\r\nStep 2:\r\n\r\nStep 3:\r\n\r\nStep 4:\r\n\r\nStep 5:\r\n\r\nStep 6:\r\n\r\nStep 7:\r\n\r\nThe elevation of point B = 105.92 feet.\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-08-26T16:49:32-04:00",
    "input_file": {}
  },
  {
    "path": "posts/2021-08-20-first-class/",
    "title": "ECIV 340L Introduction: Fall 2021",
    "description": "First Class of Fall 2021",
    "author": [
      {
        "name": "ECIV 340L, CEE, UofSC",
        "url": {}
      }
    ],
    "date": "2021-08-20",
    "categories": [],
    "contents": "\r\n\r\nbody {\r\ntext-align: justify}\r\nRELATED RESOUCES:\r\nLECTURE SLIDES\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-08-20T11:36:41-04:00",
    "input_file": {}
  }
]
